gdgly/NUC97X_JS/STM32F4xx/DL698/RM_3762.c
			}
			break;
	#if(USER/100)==17//江苏系
			case 19:
				switch(Terminal_Router->RouterInitSubTask)
				{
					case 0:
						switch(UARTCtrl->SubTask)
						{
							case 0://速率9600
								UARTCtrl->BpsCtrl=0xb+(6<<5);
								Terminal_Router->BandRate=9+(1<<15);
								break;
							case 1://速率115200
								UARTCtrl->BpsCtrl=0xb+(10<<5);
								Terminal_Router->BandRate=112+(1<<15);
								break;
							case 2://速率38400
								UARTCtrl->BpsCtrl=0xb+(8<<5);
								Terminal_Router->BandRate=37+(1<<15);
								break;
							case 3://速率19200
								UARTCtrl->BpsCtrl=0xb+(7<<5);
								Terminal_Router->BandRate=18+(1<<15);
								break;
							case 4://速率57600
								UARTCtrl->BpsCtrl=0xb+(9<<5);
								Terminal_Router->BandRate=56+(1<<15);
								break;
							case 5://速率4800
								UARTCtrl->BpsCtrl=0xb+(5<<5);
								Terminal_Router->BandRate=4+(1<<15);
								break;
							case 6://速率2400
								UARTCtrl->BpsCtrl=0xb+(4<<5);
								Terminal_Router->BandRate=2+(1<<15);
								break;
							case 7://速率1200
								UARTCtrl->BpsCtrl=0xb+(3<<5);
								Terminal_Router->BandRate=1+(1<<15);
								break;
							default:
								UARTCtrl->BpsCtrl=0xb+(6<<5);
								Terminal_Router->BandRate=9+(1<<15);
								break;
						}
						Init_UARTn(PORTn);//初始化UART口,入口通信控制字已填入
						Pin_OutH(PIN_PLC_RST);//引脚输出高,入口引脚使用名
						Terminal_Router->RouterInitSubTask++;
						break;
					case 1:
						Uart_3762_TxData(PORTn,3,10,0);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
						Terminal_Router->RouterInitSubTask++;
						break;
					case 2:
						switch(UARTCtrl->Task)//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
						{
							case 1://1=完成1帧发收
									UARTCtrl->SubTask=0;
									UARTCtrl->Task=5;
									Terminal_Router->RouterInitSubTask=0;
									Terminal_Router->RouterInitTask=4;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
									break;
							case 0://0=空闲
							case 2://2=接收超时(或错误)
								if(Terminal_Router->RouterInitReCount<2)
								{
									Terminal_Router->RouterInitReCount++;
									Uart_3762_TxData(PORTn,3,10,0);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
									return;
								}
								UARTCtrl->SubTask++;
								Terminal_Router->RouterInitSubTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
								break;
						}
						break;
					default:
						Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
						break;
				}
				break;
	#endif
			
		case 4://模块自行初始化延时
		#if (USER/100)==0
			Terminal_Ram->RouterCheck_S_Timer=60;//60S,等待路由开机自动上报帧
		#else
			Terminal_Ram->RouterCheck_S_Timer=10;//10S,等待路由开机自动上报帧
		#endif
			Terminal_Router->RouterInitSubTask=0;//子任务
			Terminal_Router->RouterInitTask++;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
			break;
		case 5://等待路由开机自动上报帧
			switch(UARTCtrl->Task)//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
			{
				case 1://1=完成1帧发收
					Terminal_Router->RouterInitSubTask=0;//子任务
					Terminal_Router->RouterInitTask++;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
					break;
				case 0://0=空闲
				case 2://2=接收超时(或错误)
					if(Terminal_Ram->RouterCheck_S_Timer!=0)//24 载波路由器死机秒定时器
					{
						UARTCtrl->Task=5;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
						UARTCtrl->RxByte=0;//RX计数(已接收字节数)=0
						break;
					}
					Terminal_Router->RouterInitSubTask=0;//子任务
					Terminal_Router->RouterInitTask+=2;//不回确认帧
					break;
			}
			break;
		case 6://回确认帧(主动上报厂商代码的响应,发确认帧停止)
			switch(Terminal_Router->RouterInitSubTask)
			{
				case 0:
					i=p8rx[13];
					Terminal_Router->RouterRunMode_1=i&0x0f;//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
					MWR(0xffffffff,((u32)p8tx)+128,6);
					Uart_3762_TxData(PORTn,0,1,6);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
					Terminal_Router->RouterInitSubTask++;//子任务
					break;
				case 1://等待完成
					if((UARTCtrl->Task==3)||(UARTCtrl->Task==4))//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
					{
						break;
					}
					if(Get_Uart_3762_RxData_AFN_Fn(PORTn)==0x030A)//UART_3762接收数据得到AFN,Fn;B15-B8=AFN,B7-B0=Fn
					{//正确收到AFN3F10上报帧
						Terminal_Router->RouterInitTask+=2;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
						Terminal_Router->RouterInitSubTask=3;//子任务
						UARTCtrl->Task=1;//1=完成1帧发收
						break;
					}
					Terminal_Router->RouterInitSubTask=0;//子任务
					Terminal_Router->RouterInitTask++;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
					break;
			}
			break;
		case 7://
			//东软模块复位后响应第1帧需3抄左右,故加入3抄延时
			p16timer[0]=3000/10;//发送后接收超时定时值ms/10(半字对齐)
			Terminal_Router->RouterInitTask++;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
			break;
		case 8://读本地模块运行模式
			switch(Terminal_Router->RouterInitSubTask)
			{
				case 0:
					if(p16timer[0]==0)//发送后接收超时定时值ms/10(半字对齐)
					{
						Terminal_Router->RouterInitSubTask++;
					}
					break;
				case 1://
					if(UARTCtrl->Task<=2)//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
					{
						if(UARTCtrl->Task!=2)//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
						{//上电后可能已接到多帧上报,收完多帧
							UARTCtrl->RxByte=0;//RX计数(已接收字节数)=0
							UARTCtrl->Task=5;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
							p16timer[0]=1000/10;//发送后接收超时定时值ms/10(半字对齐)
						}
						else
						{
							Terminal_Router->RouterInitSubTask++;
						}
					}
					break;
				case 2:
					Uart_3762_TxData(PORTn,3,10,0);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
					Terminal_Router->RouterInitSubTask++;
					break;
				case 3:
					switch(UARTCtrl->Task)//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
					{
						case 1://1=完成1帧发收
							if(Get_Uart_3762_RxData_AFN_Fn(PORTn)!=0x030A)//UART_3762接收数据得到AFN,Fn;B15-B8=AFN,B7-B0=Fn
							{
								UARTCtrl->RxByte=0;//RX计数(已接收字节数)=0
								UARTCtrl->Task=5;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
								p16timer[0]=1000/10;//发送后接收超时定时值ms/10(半字对齐)
								break;
							}
//							Comm_Ram->SelfTestFlags|=(1<<16);//B16=载波模块(自动)
							UARTCtrl->Task=0;//0=空闲,其他转发等插入操作
							i=p8rx[13+30]+(p8rx[13+31]<<8);
							switch(i)
							{
							//电力线
								case (('5'<<8)+'0')://正泰
									Comm_Ram->RouterType=1;//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康,6=力合微,7=
									break;
								case (('T'<<8)+'C')://鼎信
									Comm_Ram->RouterType=2;//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康,6=力合微,7=
									break;
								case (('E'<<8)+'S')://东软
									Comm_Ram->RouterType=3;//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康,6=力合微,7=
									break;
								case (('C'<<8)+'X')://晓晨
									Comm_Ram->RouterType=4;//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康,6=力合微,7=
									break;
								case (('0'<<8)+'1')://瑞斯康
									Comm_Ram->RouterType=5;//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康,6=力合微,7=
									break;
								case (('L'<<8)+'H')://力合微
									Comm_Ram->RouterType=6;//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康,6=力合微,7=
									break;
								case (('N'<<8)+'X')://讯能
									Comm_Ram->RouterType=7;//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康,6=力合微,7=讯能
									break;
								case (('Q'<<8)+'L')://钱龙
									Comm_Ram->RouterType=8;//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康,6=力合微,7=讯能
									break;
								case (('R'<<8)+'H')://华瑞
									Comm_Ram->RouterType=9;//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康,6=力合微,7=讯能
									break;
								case (('S'<<8)+'S')://新开普
									Comm_Ram->RouterType=10;//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康,6=力合微,7=讯能
									break;
								case 0x514A://前景无忧
									Comm_Ram->RouterType=11;//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康,6=力合微,7=讯能
									break;
								case (('W'<<8)+'X')://万形
									Comm_Ram->RouterType=12;
									break;
								
