gdgly/NUC97X_JS/STM32F4xx/DL698/RM_3762.c
							//小无线
								case (('M'<<8)+'X')://麦希
									Comm_Ram->RouterType=101;//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康,6=力合微,7=;100=保留,101=麦希,102=友讯达,103=有方
									break;
								case (('F'<<8)+'C')://友讯达
									Comm_Ram->RouterType=102;//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康,6=力合微,7=;100=保留,101=麦希,102=友讯达,103=有方
									break;
								case (('N'<<8)+'W')://有方
									Comm_Ram->RouterType=103;//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康,6=力合微,7=;100=保留,101=麦希,102=友讯达,103=有方
									break;
								case (('S'<<8)+'R')://桑锐
									Comm_Ram->RouterType=104;//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康,6=力合微,7=;100=保留,101=麦希,102=友讯达,103=有方
									break;
									
								default:
									Comm_Ram->RouterType=0;//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康,6=力合微,7=
									break;
							}
							
							i=p8rx[13];
							Terminal_Router->RouterRunMode_1=i&0x0f;//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
							Terminal_Router->RouterRunMode_2=(i>>4)&0x1;//路由运行模式_路由管理方式：0表示本地通信模块无路由管理功能，仅实现通信的调制解调功能，1表示本地通信模块带有路由管理功能
							if(Comm_Ram->RouterType==7)//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康,6=力合微,7=讯能
							{//讯能此项有误
								Terminal_Router->RouterRunMode_2=0;//路由运行模式_路由管理方式：0表示本地通信模块无路由管理功能，仅实现通信的调制解调功能，1表示本地通信模块带有路由管理功能
							}
							Terminal_Router->RouterRunMode_3=(i>>5)&0x1;//路由运行模式_测量点信息模式：0表示不需要下发测量点信息；1表示需要下发测量点信息
						#if FORCEiACTIVE==0//0=否,1=是;强制集中器主动抄表
							Terminal_Router->RouterRunMode_4=(i>>6)&0x3;//路由运行模式_周期抄表模式：01表示通信模块仅支持集中器主导的周期抄表模式，10表示通信模块仅支持路由主导的周期抄表模式；11表示通信模块对两种抄表模式都支持；00保留
						#else
							Terminal_Router->RouterRunMode_4=1;//路由运行模式_周期抄表模式：01表示通信模块仅支持集中器主导的周期抄表模式，10表示通信模块仅支持路由主导的周期抄表模式；11表示通信模块对两种抄表模式都支持；00保留
						#endif
							if(Comm_Ram->RouterType==10)//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康,6=力合微,7=讯能,8=钱龙,9=华瑞,10=新开普
							{//新开普强制集中器主动抄表,同时不加0xfe
								Terminal_Router->RouterRunMode_4=1;//路由运行模式_周期抄表模式：01表示通信模块仅支持集中器主导的周期抄表模式，10表示通信模块仅支持路由主导的周期抄表模式；11表示通信模块对两种抄表模式都支持；00保留
							}
							i=p8rx[13+1];
							Terminal_Router->RouterRunMode_5=i&0x07;//路由运行模式_传输延时参数支持：由D2、D1、D0等三个位表示，分别代表广播、从节点监控、路由主动抄表等三种命令支持向集中器提供传输延时参数的情况，1表示支持提供传输延时参数，0表示不支持
							Terminal_Router->RouterRunMode_6=(i>>3)&0x3;//路由运行模式_失败节点切换发起方式：D0置1表示通信模块自主切换待抄节点，D1置1表示集中器发起通知通信模块切换待抄节点
							Terminal_Router->RouterRunMode_7=(i>>5)&0x1;//路由运行模式_广播命令确认方式：0表示广播命令在本地通信模块执行广播通信过程完毕后返回确认报文，1表示广播命令在本地信道执行广播通信之前就返回确认报文，需要集中器等待的时间在确认报文的"等待执行时间"信息中体现
							Terminal_Router->RouterRunMode_8=(i>>6)&0x3;//路由运行模式_广播命令信道执行方式：0表示执行广播命令不需要信道标识，1表示广播命令要根据报文中的信道标识逐个来发送，其它取值保留
							i=p8rx[13+6];
							Terminal_Router->MaxOverTime=i;//从节点监控最大超时时间秒
						//#if(USER/100)==17//江苏系
							//i=p8rx[13+3];
							//if((i&0x10)!=0)
							//{
								//WarningOccur(PORTn,(u8 *)"支持分钟采集");//告警发生,入口告警代码和告警字符串
								//Terminal_Router->MinuteCollect=1;//主节点支持分钟级采集
							//}
							//else
							//{
								//WarningOccur(PORTn,(u8 *)"不支持分钟采集");//告警发生,入口告警代码和告警字符串
								//Terminal_Router->MinuteCollect=0;//主节点不支持分钟级采集
							//}
						//#endif
							
							i=p8rx[13+7]+(p8rx[13+8]<<8);
							Terminal_Router->MaxBroadcastOverTime=i;//最大广播超时时间秒
							i=p8rx[13+9]+(p8rx[13+10]<<8);
							Terminal_Router->MaxTxByte=i;//最大支持报文长度(半字对齐)
							i=p8rx[13+11]+(p8rx[13+12]<<8);
							Terminal_Router->MaxFileByte=i;//文件传输支持的最大单个数据包长度(半字对齐)
							i=p8rx[13+13];
							Terminal_Router->MaxUpDateTime=i;//升级操作最大等待时间秒(半字对齐)
							i=p8rx[13+20]+(p8rx[13+21]<<8);
							if(Comm_Ram->RouterType==102)//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康,6=力合微,7=;100=保留,101=麦希,102=友讯达,103=有方
							{//友讯达支持的最大从节点数-1
								i--;
							}
							Terminal_Router->MaxNoteNum=i;//支持的最大从节点数(半字对齐)
							MR((u32)&Terminal_Router->RouterCODE,((u32)p8rx)+13+30,4);//厂商代码 ASCII 2,芯片代码 ASCII 2
							Data_Inverse((u32)&Terminal_Router->RouterCODE,2);//数据倒序(高低字节调换),入口Le>=2
							Data_Inverse(((u32)&Terminal_Router->RouterCODE)+2,2);//数据倒序(高低字节调换),入口Le>=2
							MR((u32)&Terminal_Router->RouterVer,((u32)p8rx)+13+34,5);//路由器版本号,分别为:3BYTE日月年,2BYTE版本
							
						#if MainProtocol==698
						//属性2（设备对象列表，只读）∷=array 本地通信模块单元
						//本地通信模块单元∷=structure
						//{
						//端口描述符   visible-string，
						//通信参数     COMDCB，
						//版本信息     VersionInfo
						//}
						//VersionInfo∷=structure
						//{
						//  厂商代码    visible-string(SIZE(2))，
						//  芯片代码    visible-string(SIZE(2))，
						//  版本日期     Date，
						//  软件版本     long-unsigned
						//}
							p8=(u8*)ADDR_F209_2;
							p8[0]=DataType_array;
							p8[1]=1;
							p8[2]=DataType_structure;
							p8[3]=3;
							//端口描述符   visible-string
							p8[4]=DataType_visible_string;
							p8[5]=0;
							//通信参数     COMDCB
							//COMDCB∷=SEQUENCE
							//{
							//波特率    ENUMERATED
							//{
							//300bps（0），   600bps（1），     1200bps（2），
							//2400bps（3），  4800bps（4），    7200bps（5），
							//9600bps（6），  19200bps（7），   38400bps（8），
							//57600bps（9）， 115200bps（10）， 自适应（255）
							//}，
							//校验位  ENUMERATED {无校验（0），奇校验（1），偶校验（2）}，
							//数据位  ENUMERATED {5（5），6（6），7（7），8（8）}，
							//停止位  ENUMERATED {1（1），2（2）}，
							//流控    ENUMERATED {无(0)，硬件(1)，软件(2)}
							//}
							p8[6]=DataType_COMDCB;
						#if(USER/100)==17//江苏系
							switch(Terminal_Router->BandRate&(0x7f))
							{
								case 112:
									p8[7]=10;
									break;
								case  56:
									p8[7]=9;
									break;
								case 37:
									p8[7]=8;
									break;
								case  18:
									p8[7]=7;
									break;
								case 9:
									p8[7]=6;
									break;
								case  4:
									p8[7]=4;
									break;
								case 2:
									p8[7]=3;
									break;
								case  1:
									p8[7]=2;
									break;
								default:
									p8[7]=6;
									break;
							}
						#else
							p8[7]=6;//波特率9600bps（6）
						#endif
							p8[8]=2;//校验位  ENUMERATED {无校验（0），奇校验（1），偶校验（2）}
							p8[9]=8;//数据位  ENUMERATED {5（5），6（6），7（7），8（8）}，
							p8[10]=1;//停止位  ENUMERATED {1（1），2（2）}，
							p8[11]=2;//流控    ENUMERATED {无(0)，硬件(1)，软件(2)}
							//版本信息     VersionInfo
							p8[12]=DataType_structure;
							p8[13]=4;
						//  厂商代码    visible-string(SIZE(2))，
							p8[14]=DataType_visible_string;
							p8[15]=2;
							i=p8rx[13+30]+(p8rx[13+31]<<8);
							p8[16]=i>>8;
							p8[17]=i;
						//  芯片代码    visible-string(SIZE(2))，
							p8[18]=DataType_visible_string;
							p8[19]=2;
							i=p8rx[13+32]+(p8rx[13+33]<<8);
							p8[20]=i>>8;
							p8[21]=i;
						//  版本日期     Date，
							p8[22]=DataType_date;
							i=p8rx[13+36];//年
							i=bcd_hex(i);
							i+=2000;
							p8[23]=i>>8;
							p8[24]=i;
							i=p8rx[13+35];//月
							i=bcd_hex(i);
							p8[25]=i;
							i=p8rx[13+34];//日
							i=bcd_hex(i);
							p8[26]=i;
							p8[27]=0xff;//周
						//  软件版本     long-unsigned
							p8[28]=DataType_long_unsigned;
							i=p8rx[13+37]+(p8rx[13+38]<<8);
							p8[29]=i>>8;
							p8[30]=i;
						#endif
						
							DisplayRouterVer(PORTn);//显示路由厂家和版本号
							Terminal_Router->RouterInitReCount=0;//命令重发计数
							Terminal_Router->RouterInitSubTask=0;//子任务
						#if(USER/100)==17//江苏系
							Terminal_Router->RouterInitTask=18;
						#else
							Terminal_Router->RouterInitTask++;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
						#endif
							break;
						case 0://0=空闲
						case 2://2=接收超时(或错误)
							if(Terminal_Router->RouterInitReCount<2)
							{
								Terminal_Router->RouterInitReCount++;
								Uart_3762_TxData(PORTn,3,10,0);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
								return;
							}
							
							Comm_Ram->MODE3in1=0;//三合一终端当前运行模式:0=专变,1=集中器
							UARTCtrl->LinkTask=0;
							
