gdgly/NUC97X_JS/STM32F4xx/DL698/RM_3762.c
							WarningOccur(PORTn,(u8 *)"没检测到载波模块");//告警发生,入口告警代码和告警字符串
//							Comm_Ram->SelfTestFlags&=~(1<<16);////B16=载波模块,(置位表示OK)
							Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
							break;
					}
					break;
				default:
					Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
					break;
			}
			break;
	#if(USER/100)==17//江苏系
		case 18://设置本地模块波特率
			switch(Terminal_Router->RouterInitSubTask)
			{
				case 0:
					p8tx+=128;
					p8tx[0]=3;//注册允许状态:允许；工作状态：学习
					p8tx[1]=Terminal_Router->BandRate&(0xff);
					p8tx[2]=Terminal_Router->BandRate>>8;
					Uart_3762_TxData(PORTn,0x11,4,3);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
					Terminal_Router->RouterInitSubTask=1;
					break;
				case 1:
					i=Uart_3762_RxData_AFN00_F1(PORTn,0x11,4,3);//UART_3762接收AFN00F1确认数据,入口AFN,Fn,LEN_Data接收失败重发用参数;返回0未确认1确认2失败
					if(i==2)
					{//设置本地模块波特率失败
						Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
					}
					else
					{
						Terminal_Router->RouterInitTask=9;
					}
					break;
				default:
					Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
					break;
			}
			break;
	#endif
		case 9://读主节点地址
			switch(Terminal_Router->RouterInitSubTask)
			{
				case 0://发送
					Uart_3762_TxData(PORTn,0x03,4,0);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
					Terminal_Router->RouterInitSubTask=1;
					break;
				case 1://接收
					switch(UARTCtrl->Task)//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
					{
						case 1://1=完成1帧发收
							if(Get_Uart_3762_RxData_AFN_Fn(PORTn)!=0x0304)//UART_3762接收数据得到AFN,Fn;B15-B8=AFN,B7-B0=Fn
							{//AFN=03H,Fn=4
								UARTCtrl->RxByte=0;//RX计数(已接收字节数)=0
								UARTCtrl->Task=5;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
								p16timer[0]=1000/10;//发送后接收超时定时值ms/10(半字对齐)
								break;
							}
							d64a=MRR(ADDR_4001+2,6);
							d64a=R_Inverse(d64a,6);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
							MWR(d64a,(u32)&Terminal_Router->RouterAddr,6);
							i=DataComp((u32)&Terminal_Router->RouterAddr,((u32)p8rx)+13,6);//数据比较,返回0=相等;当Byte>8时返回1=不相等;当Byte<=8时1=Data1>Data2,2=Data1<Data2
							if(i==0)
							{//地址相同跳过设置
								Terminal_Router->RouterInitTask++;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
							}
							Terminal_Router->RouterInitReCount=0;//命令重发计数
							Terminal_Router->RouterInitSubTask=0;//子任务
							Terminal_Router->RouterInitTask++;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
							break;
						case 0://0=空闲
						case 2://2=接收超时(或错误)
							if(Terminal_Router->RouterInitReCount<2)
							{
								Terminal_Router->RouterInitReCount++;
								Uart_3762_TxData(PORTn,0x03,4,0);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
								return;
							}
							Terminal_Router->RouterInitReCount=0;//命令重发计数
							Terminal_Router->RouterInitSubTask=0;//子任务
							Terminal_Router->RouterInitTask++;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
							break;
					}
					break;
				default:
					Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
					break;
			}
			break;
		case 10://设置主节点地址
			switch(Terminal_Router->RouterInitSubTask)
			{
				case 0:
					d64a=MRR(ADDR_4001+2,6);
					d64a=R_Inverse(d64a,6);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
					MWR(d64a,(u32)&Terminal_Router->RouterAddr,6);
				
					MR(((u32)p8tx)+128,(u32)&Terminal_Router->RouterAddr,6);
					Uart_3762_TxData(PORTn,5,1,6);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
					Terminal_Router->RouterInitSubTask=1;
					break;
				case 1:
					i=Uart_3762_RxData_AFN00_F1(PORTn,5,1,6);//UART_3762接收AFN00F1确认数据,入口AFN,Fn,LEN_Data接收失败重发用参数;返回0未确认1确认2失败
					if(i==2)
					{//设置主节点地址失败
						Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
					}
					break;
				default:
					Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
					break;
			}
			break;
		case 11://
			Terminal_Router->RouterInitTask++;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
			break;
		case 12://参数初始化(清档案信息,恢复至出厂设置)
/*
			i=3;
			if(i>=3)
			{
				switch(Terminal_Router->RouterInitSubTask)
				{
					case 0://发送
						Uart_3762_TxData(PORTn,0x01,2,0);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
						Terminal_Router->RouterInitSubTask=1;
						break;
					case 1://接收
						Uart_3762_RxData_AFN00_F1(PORTn,0x01,2,0);//UART_3762接收AFN00F1确认数据,入口AFN,Fn,LEN_Data接收失败重发用参数;返回0未确认1确认2失败
						//只发3次若失败则放弃转到下1步
						break;
					default:
						Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
						break;
				}
			}
			else
			{
				Terminal_Router->RouterInitTask++;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
			}
*/
			Terminal_Router->RouterInitTask++;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
			break;
		case 13://数据初始化(节点侦听信息)
/*
			i=3;
			if(i>=2)
			{
				switch(Terminal_Router->RouterInitSubTask)
				{
					case 0:
						Uart_3762_TxData(PORTn,0x01,3,0);
						Terminal_Router->RouterInitSubTask=1;
						break;
					case 1:
						Uart_3762_RxData_AFN00_F1(PORTn,0x01,3,0);//UART_3762接收AFN00F1确认数据,入口AFN,Fn,LEN_Data接收失败重发用参数;返回0未确认1确认2失败
						//只发3次若失败则放弃转到下1步
						break;
					default:
						Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
						break;
				}
			}
			else
			{
				Terminal_Router->RouterInitTask++;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
			}
*/
			Terminal_Router->RouterInitTask++;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
			break;
		case 14://设初始档案同步标志
			//MC(0,ADDR_AFN01Fx+5,1);//清复位命令的Fn值
			
			UARTCtrl->Task=0;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
			Terminal_Router->RouterSynTask=1;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
			Terminal_Router->RouterInitTask++;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
			break;
		case 15://初始档案同步过程
			Terminal_RouterSyn(PORTn);//路由器档案同步
			//显示电表配置同步数量
			i=CopyString((u8 *)"档案同步",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
			i+=HEX_ASCII(MRR((u32)&Terminal_Router->NoteNum,2),ADDR_DATABUFF+i);//HEX转为ASCII码存在Addr存贮单元,不显无效0,返回有效ASCII字符数
			MWR(0,ADDR_DATABUFF+i,1);
			WarningOccur(PORTn,(u8 *)ADDR_DATABUFF);//告警发生,入口告警代码和告警字符串
			if(Terminal_Router->RouterSynTask==0)//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
			{
				Terminal_Router->RouterInitReCount=0;//命令重发计数
				Terminal_Router->RouterInitSubTask=0;//子任务
				Terminal_Router->RouterInitTask++;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
			}
			break;
		case 16://是宽带载波,则设置宽带载波频段
			if(Terminal_Router->RouterRunMode_1!=2)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
			{//不是宽带
				Terminal_Router->RouterInitTask++;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
			}
			else
			{
				switch(Terminal_Router->RouterInitSubTask)
				{
					case 0:
						MR(((u32)p8tx)+128,ADDR_F209_9+1,1);//属性 9（宽带载波频段序号）∷ =unsigned
						Uart_3762_TxData(PORTn,0x05,16,1);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
						Terminal_Router->RouterInitSubTask=1;
						break;
					case 1:
						i=Uart_3762_RxData_AFN00_F1(PORTn,0x05,16,1);//UART_3762接收AFN00F1确认数据,入口AFN,Fn,LEN_Data接收失败重发用参数;返回0未确认1确认2失败
						if(i==2)
						{//设置失败
							Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
						}
						break;
					default:
						Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
						break;
				}
			}
			break;
		case 17://
			UARTCtrl->PowerUpDealy=1;
			if(UARTCtrl->PowerUpDealy==0)//上电延时:0=没延时,!=0已到延时
			{
				p16timer=(u16 *)Get_ADDR_UARTnTimer_S(PORTn);
				if(p16timer[0]!=0x0)
				{
					CopyString((u8 *)"载波等待上电",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
					MWR(0,ADDR_DATABUFF+12,1);
					WarningOccur(PORTn,(u8 *)ADDR_DATABUFF);//告警发生,入口告警代码和告警字符串
					return;
				}
			}
			UARTCtrl->PowerUpDealy=1;//上电延时:0=没延时,!=0已到延时
			Terminal_Router->RouterInitTask=100;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
			break;

			
		case 100://重启路由
			Terminal_Router->RouterCtrl=1;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
			Terminal_Router->RouterInitTask++;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
			break;
		case 101:
			Terminal_Router->RouterInitTask=200;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
			break;
		case 102://是宽带载波,则设置宽带载波频段
					
