gdgly/NUC97X_JS/STM32F4xx/DL698/RM_3762.c
		case 200://>=200抄表
		//路由软件更新		
//#if (((USER/100)==9)||((USER/100)==17))//河南
//			if(Terminal_Router->UpDateTask != 0)//软件更新任务
//			{
//				UpDateRouter(PORTn);//路由软件更新
//				break;
//			}
//#else
		/*
			p32=(u32*)(ADDR_E4_ENTRY);
			if((p32[64]==ADDR_E4_ENTRY)||(Terminal_Router->UpDateTask!=0))//软件更新任务
			{
				UpDateRouter(PORTn);//路由软件更新
				break;
			}
		*/
//#endif
		//路由器档案同步
			Terminal_RouterSyn(PORTn);//路由器档案同步
			if(Terminal_Router->RouterSynTask>=2)//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
			{//正在同步或同步刚正将标志设为退出恢复路由时
				//抄表暂停间隔时间清0命有表加入时启动抄表
//				if(UARTCtrl->TaskID==0)//0=抄表间隔暂停,1=抄表进行中
//				{
//					p16timer=(u16 *)&Terminal_Ram->RS4854RM_S_Timer;
//					p16timer[0]=0;
//				}
				//显示电表配置同步数量
				i=CopyString((u8 *)"档案同步",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
				i+=HEX_ASCII(MRR((u32)&Terminal_Router->NoteNum,2),ADDR_DATABUFF+i);//HEX转为ASCII码存在Addr存贮单元,不显无效0,返回有效ASCII字符数
				MWR(0,ADDR_DATABUFF+i,1);
				WarningOccur(PORTn,(u8 *)ADDR_DATABUFF);//告警发生,入口告警代码和告警字符串
				return;
			}
			if((UARTCtrl->Task==0)||(UARTCtrl->Task==2))//0=空闲,2=超时
			{
				if((UARTCtrl->SetChange6000==0x55)&&(Terminal_Ram->RouterSynDelay_S_Timer==0))//采集档案配置表有变化标志:0=没变化,0x55=变化
				{
					UARTCtrl->SetChange6000=0;//采集档案配置表有变化标志:0=没变化,0x55=变化
					Terminal_Router->RouterSynTask=1;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
					break;
				}
			}
		//抄表
			if(Terminal_Router->NoteNum==0)
			{//节点表空
				if(p16timer[0]==0)
				{
					p16timer[0]=1000/10;//下次计算TASK()在1秒后,否则会影响菜单速度
					TASK(PORTn,1);//采集任务;TaskID=b31-b28优先级,b27-b24方案类型,b23-b20采集类型,b19-b16存储时标类型,b15-b8任务号,b7-b0方案编号;返回:0表示无采集任务
				}
				UARTCtrl->Task=0;//0=空闲,以便其他任务
				DisplayRouterVer(PORTn);//显示路由厂家和版本号
				i=CopyString((u8 *)"载波___0",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
				MWR(0,ADDR_DATABUFF+i,1);
				WarningOccur(100,(u8 *)ADDR_DATABUFF);//告警发生,入口告警代码和告警字符串
				return;
			}
			i=UARTCtrl->TaskID;//当前采集任务ID;值0表示无采集任务;b31-b28优先级,b27-b24方案类型,b23-b20采集类型,b19-b16存储时标类型,b15-b8任务号,b7-b0方案编号
			if(i==0)
			{//先判任务,免整点进入曲线任务又无任何表抄时路由暂停与恢复延时
				switch(UARTCtrl->Task)//0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送)
				{
					case 0://0=空闲
						UARTCtrl->RxByte=0;
						UARTCtrl->Task=5;//正在接收
						break;
					case 2://2=接收超时(或错误)
						UARTCtrl->Task=0;//空闲1次
						break;
					case 5://5=正在接收
						if(p16timer[0]>(1000/10))//超时定时
						{
							p16timer[0]=1000/10;//超时定时
						}
						break;
					default:
						UARTCtrl->Task=0;//空闲1次
						break;
				}
				WarningOccur(PORTn,(u8 *)"载波 当前任务完成");//告警发生,入口告警代码和告警字符串
				//myprintf("[%s:%d]:载波当前没有任务\n",(u32)&__func__,(u32)__LINE__,0);
				if(UARTCtrl->RTCS_TASK!=Comm_Ram->DL698YMDHMS[6])//实时钟更新标志原始秒(Task运算)
				{
					UARTCtrl->RTCS_TASK=Comm_Ram->DL698YMDHMS[6];//实时钟更新标志原始秒(Task运算)
					TASK(PORTn,1);//采集任务;TaskID=b31-b28优先级,b27-b24方案类型,b23-b20采集类型,b19-b16存储时标类型,b15-b8任务号,b7-b0方案编号
				}
				
				i=Terminal_Router->RouterRunMode_1;
			#if RM_HPLC_Concurrency==0//0=否,1=是;宽带载波集中器主动并发抄表
				if(i==3)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
			#else
				if(i!=1)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
			#endif
				{//微功率无线,需路由学习完成后才能抄表,否则直接返回否认
					if((Terminal_Router->RUNState&1)==0)//当前路由运行状态(从模块中读取值):b2=上报事件标志,b1=工作标志,b0=路由完成标志
					{
						if(p16timer[0]==0)
						{
							Terminal_Router->RouterCtrl=4;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
						}
					}
				}
				
				return;
			}
		#if RM_HPLC_Concurrency==0//0=否,1=是;宽带载波集中器主动并发抄表
			if((Terminal_Router->RouterRunMode_4!=1)&&((Terminal_Router->StopFlags&(1<<17))==0))//路由运行模式_周期抄表模式:01表示通信模块仅支持集中器主导的周期抄表模式，10表示通信模块仅支持路由主导的周期抄表模式；11表示通信模块对两种抄表模式都支持；00保留
		#else
			if((Terminal_Router->RouterRunMode_4==2)&&((Terminal_Router->StopFlags&(1<<17))==0))//路由运行模式_周期抄表模式:01表示通信模块仅支持集中器主导的周期抄表模式，10表示通信模块仅支持路由主导的周期抄表模式；11表示通信模块对两种抄表模式都支持；00保留
		#endif
			{//10仅支持路由主导的周期抄表模式
				i>>=28;
				if(i==0)//优先级=0;上电启抄,每小时曲线等用点抄
				{
					//点抄:任务号RMTASKnoPOWER：停上电,代理，广播校时，自动搜表，电能表主动上报
					//正常抄任务完成时因TaskID=0，故也进入此
					if((Terminal_Router->RUNState&2)!=0)//当前路由运行状态(从模块中读取值):b2=上报事件标志,b1=工作标志,b0=路由完成标志
					{
						//Terminal_Router->StopFlags|=1;//b0=任务号0抄停电事件
						Terminal_Router->RouterCtrl=2;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
						return;
					}
					RM_3762_iActive(PORTn);//载波抄表(集中器主导的周期抄表模式)
					return;
				}
				//路由抄读
				RM_3762_RouterActive(PORTn);//载波抄表(路由模块主导的周期抄表模式)
			}
			else
			{//01,03表示通信模块仅支持集中器主导的周期抄表模式;或主动上报
			//#if (USER/100)!=0//不是电科院送检
				i=Terminal_Router->RouterRunMode_1;
			#if RM_HPLC_Concurrency==0//0=否,1=是;宽带载波集中器主动并发抄表
				if(i==3)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
			#else
				if(i!=1)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
			#endif
				{//微功率无线,需路由学习完成后才能抄表,否则直接返回否认
					if((Terminal_Router->RUNState&1)==0)//当前路由运行状态(从模块中读取值):b2=上报事件标志,b1=工作标志,b0=路由完成标志
					{
						if(Terminal_Router->NoteNumOver==0)//AFN04F10配置的从节点数>模块支持的最大从节点数;0=否,1=是
						{
							WarningOccur(PORTn,(u8 *)"载波正在组网");//告警发生,入口告警代码和告警字符串
						}
						else
						{
							WarningOccur(PORTn,(u8 *)"从节点数超限!");//告警发生,入口告警代码和告警字符串
						}
						p16timer=(u16 *)&Terminal_Ram->Trip3_MS_Timer;//终端跳闸3 10MS定时器
						if(p16timer[0]==0)
						{
							p16timer[0]=10000/10;//下次读在10秒后
							Terminal_Router->RouterCtrl=4;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
						}
						//myprintf("[%s:%d]:载波还在路由学习中\n",(u32)&__func__,(u32)__LINE__,0);
						return;
					}
				}
			//#endif
			#if RM_HPLC_Concurrency==0//0=否,1=是;宽带载波集中器主动并发抄表
				RM_3762_iActive(PORTn);//载波抄表(集中器主导的周期抄表模式)
			#else
				if(Terminal_Router->RouterRunMode_1!=2)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
				{//不是宽带
					RM_3762_iActive(PORTn);//载波抄表(集中器主导的周期抄表模式)
				}
				else
				{//是宽带
					RM_3762_iActive_HPLC(PORTn);//集中器主动抄表(宽带载波并发抄表)
				}
			#endif
			}
			break;
		case 201://延时路由恢复
			if(Terminal_Ram->RouterCtrl_MS_Timer==0)//16 路由控制恢复延时 10MS定时器
			{
				Terminal_Router->RouterCtrl=5;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
				Terminal_Router->RouterInitTask=202;//路由恢复检查
			}
			WarningOccur(PORTn,(u8 *)"载波路由恢复延时");//告警发生,入口告警代码和告警字符串
			switch(UARTCtrl->Task)//0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
			{
				case 0://0=空闲
					UARTCtrl->RxByte=0;//RX计数(已接收字节数)=0
					p16timer[0]=100/10;//发送后接收超时定时值ms/10(半字对齐)
					UARTCtrl->Task=5;//接收
					break;
				case 1://1=完成1帧发收
				case 2://2=接收超时(或错误)
					UARTCtrl->Task=0;
					break;
			}
			break;
		case 202://路由恢复检查
			if((Terminal_Router->RUNState&2)==0)//当前路由运行状态(从模块中读取值):b2=上报事件标志,b1=工作标志,b0=路由完成标志
			{
				Terminal_Router->RouterInitTask=0;//恢复失败
			}
			else
			{
				Terminal_Router->RouterInitTask=200;//恢复成功
				WarningOccur(PORTn,(u8 *)"载波路由恢复成功");//告警发生,入口告警代码和告警字符串
			}
			break;
			
		default:
			Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
			break;
	}
}


void Terminal_RouterSyn(u32 PORTn)//路由器档案同步
{
	u32 i;
	u32 x;
	u32 y;
	u32 z;
	u64 d64a;
	u64 d64b;
	u8* p8rx;
	u8* p8tx;
	UARTCtrl_TypeDef * UARTCtrl;
	u16* p16timer;
	u64 d64c;
	u8 *p8s;
	u8* p8d;
	u32 NoteNum;
	
