gdgly/NUC97X_JS/STM32F4xx/DL698/RM_3762.c
	d64c=d64c;
	p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
	p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	switch(Terminal_Router->RouterSynTask)//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
	{
		default:
			Terminal_Router->RouterSynTask=0;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
			break;
		case 1://1=等待启动
			if((UARTCtrl->Task==0)||(UARTCtrl->Task==2))//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
			{
				if(Terminal_Router->RouterInitTask>=200)//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
				{
					Terminal_Router->StopFlags|=(1<<8);//暂停路由
					Terminal_Router->RouterCtrl=2;//路由器控制命令0=空,1=重启,2=暂停,3=恢复,4=检测;完成后自动回到0
				}
				if(Terminal_Router->RouterRunMode_1==3)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
				{//小无线,同步后总是置学习完成标志=0
					Terminal_Router->RUNState=0;//当前路由运行状态(从模块中读取值):b2=上报事件标志,b1=工作标志,b0=路由完成标志
				}
			#if (USER/100)==0//电科院测试
				Terminal_Router->NoteNum=0;//电科院测试总是从0开始同步
			#endif
				Terminal_Router->RouterInitSubTask=0;//子任务
				Terminal_Router->RouterSynTask++;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
				
			}
			break;
		case 2://查询从节点数量
		#if (USER/100)==0//电科院测试
			if(Terminal_Router->RouterRunMode_2==0)//路由运行模式_路由管理方式：0表示本地通信模块无路由管理功能，仅实现通信的调制解调功能，1表示本地通信模块带有路由管理功能
			{
				Terminal_Router->RouterSynTask++;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
				break;
			}
		#else
			if(Terminal_Router->RouterRunMode_3==0)//路由运行模式_测量点信息模式：0表示不需要下发测量点信息；1表示需要下发测量点信息
			{//0表示不需要下发测量点信息
				Terminal_Router->RouterSynTask++;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
				break;
			}
		#endif
			switch(Terminal_Router->RouterInitSubTask)
			{
				case 0://发送
					Uart_3762_TxData(PORTn,0x10,1,0);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
					Terminal_Router->RouterInitSubTask++;//子任务
					break;
				case 1://接收
					switch(UARTCtrl->Task)//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
					{
						case 1://1=完成1帧发收
							UARTCtrl->Task=0;//0=空闲,其他转发等插入操作
							if(Get_Uart_3762_RxData_AFN_Fn(PORTn)==0x1001)//UART_3762接收数据得到AFN,Fn;B15-B8=AFN,B7-B0=Fn
							{//AFN=10H,Fn=1
								x=p8rx[13]+(p8rx[14]<<8);
								if(Terminal_Router->RouterRunMode_1==3)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
								{//微功率无线,总已知节点数=0
									Terminal_Router->NoteNum=0;//总已知节点数总是从0开始
								}
								else
								{//电力线载波
									if(Terminal_Router->NoteNum!=x)
									{
										Terminal_Router->NoteNum=0;//已知节点数
									}
								}
								Terminal_Router->ModeNoteNum=x;//从模块读取的模块返回从节点数(半字对齐)
								Terminal_Router->RouterInitReCount=0;//命令重发计数
								Terminal_Router->RouterInitSubTask=0;//子任务
								Terminal_Router->RouterSynTask++;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
							}
							else
							{
								p16timer=(u16 *)Get_ADDR_UARTnTimer(PORTn);
								p16timer[0]=1000/10;//发送后接收超时定时值ms/10(半字对齐)
								UARTCtrl->RxByte=0;//RX计数(已接收字节数)=0
								UARTCtrl->Task=5;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
							}
							break;
						case 0://0=空闲
						case 2://2=接收超时(或错误)
							if(Terminal_Router->RouterInitReCount<2)//命令重发计数
							{
								Terminal_Router->RouterInitReCount++;//命令重发计数
								Terminal_Router->RouterInitSubTask=0;//子任务=发送
							}
							else
							{
								Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
							}
							break;
					}
					break;
				default:
					Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
					break;
			}
			break;
		case 3://读取从节点信息
		#if (USER/100)==0//电科院测试
			if(Terminal_Router->RouterRunMode_2==0)//路由运行模式_路由管理方式：0表示本地通信模块无路由管理功能，仅实现通信的调制解调功能，1表示本地通信模块带有路由管理功能
			{
				Terminal_Router->RouterSynTask++;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
				break;
			}
		#else
			if(Terminal_Router->RouterRunMode_3==0)//路由运行模式_测量点信息模式：0表示不需要下发测量点信息；1表示需要下发测量点信息
			{//0表示不需要下发测量点信息
				Terminal_Router->RouterSynTask++;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
				break;
			}
		#endif
			switch(Terminal_Router->RouterInitSubTask)
			{
				case 0://清当前路由器中从节点数
					if(Terminal_Router->ModeNoteNum==0)//从模块读取的模块返回从节点数(半字对齐)
					{
						Terminal_Router->RouterSynTask++;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
						return;
					}
					Terminal_Router->TempCount=1;//删除或添加节点数计数(序号从1开始)
					Terminal_Router->ReadNoteNum=0;//档案同步时从模块已读取的节点数(半字对齐)
					Terminal_Router->RouterInitSubTask++;//子任务
					break;
				case 1://发送
					x=Terminal_Router->TempCount;
					MWR(x,((u32)p8tx)+128,2);//从节点起始序号
					p8tx[128+2]=10;//本次读10个
					Uart_3762_TxData(PORTn,0x10,2,3);//376.2发送数据填入发送区,入口时若有信息域目的地址数据单元等则已填入,数据单元暂固定填入发送缓冲区+128地址
					Terminal_Router->RouterInitSubTask++;//子任务
					break;
				case 2://接收
					switch(UARTCtrl->Task)//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
					{
						case 1://1=完成1帧发收
							UARTCtrl->Task=0;//0=空闲,其他转发等插入操作
							y=0;
							if(Get_Uart_3762_RxData_AFN_Fn(PORTn)==0x1002)//UART_3762接收数据得到AFN,Fn;B15-B8=AFN,B7-B0=Fn
							{//AFN=10H,Fn=2
							//myprintf("[%s:%d]:读节点信息\n",(u32)&__func__,(u32)__LINE__,0);
							//for(i=0;i<100;i++)
							//{	
								///myprintf("%02x ",p8rx[i],0,0);
							//}
							//myprintf("\n",0,0,0);
								x=Terminal_Router->NoteNum;//已知总从节点数
								y=MRR(((u32)p8rx)+13+2,1);//本次读入从节点数
								Terminal_Router->TempCount+=y;//下开始序号
								Terminal_Router->ReadNoteNum+=y;//档案同步时从模块已读取的节点数(半字对齐)
								for(z=0;z<y;z++)
								{
									if((x+1)<=NUM_RMmax)
									{
										d64a=MRR(((u32)p8rx)+13+3+(z*8),6);
										for(i=0;i<x;i++)
										{
											d64b=MRR((u32)&NoteList->List[i].Addr,6);
											if(d64a==d64b)
											{
												break;//原已存在
											}
										}
										if(i==x)
										{//原没存在
											if(Terminal_Router->RouterRunMode_1!=3)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
											{//电力线载波表
												MC(0,(u32)&NoteList->List[x],LEN_NoteList);
												MWR(d64a,(u32)&NoteList->List[x].Addr,6);
												x++;
												Terminal_Router->NoteNum=x;//当前路由器中总从节点数
											}
											else
											{//微功率无线,档案地址用采集器地址
											#if SEL_RouterRunMode3ADDR==0//微功率无线发送帧目标地址:0=电能表地址，1=采集器地址
												MC(0,(u32)&NoteList->List[x],LEN_NoteList);
												MWR(d64a,(u32)&NoteList->List[x].Addr,6);
												x++;
												Terminal_Router->NoteNum=x;//当前路由器中总从节点数
											#else
												for(i=0;i<x;i++)
												{
													d64b=MRR((u32)&NoteList->List[i].CollectorAddr,6);
													if(d64a==d64b)
													{
														break;//原已存在
													}
												}
												if(i==x)
												{//原没存在
													MC(0,(u32)&NoteList->List[x],LEN_NoteList);
													MWR(d64a,(u32)&NoteList->List[x].Addr,6);
													MWR(d64a,(u32)&NoteList->List[x].CollectorAddr,6);//采集器地址
													x++;
													Terminal_Router->NoteNum=x;//当前路由器中总从节点数
												}
											#endif
											}
										}
									}
								}
							}
							else
							{
								p16timer=(u16 *)Get_ADDR_UARTnTimer(PORTn);
								p16timer[0]=1000/10;//发送后接收超时定时值ms/10(半字对齐)
								UARTCtrl->RxByte=0;//RX计数(已接收字节数)=0
								UARTCtrl->Task=5;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
								return;
							}
							if((Terminal_Router->TempCount<=NUM_RMmax)&&(Terminal_Router->ReadNoteNum<Terminal_Router->ModeNoteNum))
							{//继续读
								if(y==0)
								{
									Terminal_Router->TempCount+=10;//下开始序号从下10个开始
								}
								Terminal_Router->RouterInitSubTask=1;
							}
							else
							{//读结束
								Terminal_Router->RouterInitReCount=0;//命令重发计数
								Terminal_Router->RouterInitSubTask=0;//子任务
								Terminal_Router->RouterSynTask++;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
							}
							break;
						case 0://0=空闲
						case 2://2=接收超时(或错误)
							if(Terminal_Router->RouterInitReCount<2)//命令重发计数
							{
								Terminal_Router->RouterInitReCount++;//命令重发计数
								Terminal_Router->RouterInitSubTask=1;//子任务=发送
							}
							else
							{
								Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
							}
							break;
					}
					break;
				default:
					Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
					break;
			}
			break;
		case 4://删除从节点
			switch(Terminal_Router->RouterInitSubTask)
			{
				case 0://清删除或添加节点数计数
					Terminal_Router->TempCount=0;//删除或添加节点数计数
					p8tx[128]=0;//有要删除的节点数
					Terminal_Router->RouterInitSubTask++;//子任务
					break;
				case 1://查删除
					for(i=0;i<100;i++)
					{
						if(Terminal_Router->TempCount>=Terminal_Router->NoteNum)
						{
							if(p8tx[128]==0)//有要删除的节点数
							{//没要删除
								Terminal_Router->RouterInitSubTask=0;//子任务
								Terminal_Router->RouterSynTask++;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
								return;
							}
							else
							{//有删除
								//即发送,免其它任务影响p8tx+128后的数据
								Terminal_Router->RouterInitReCount=0;//命令重发计数
								Terminal_Router->RouterInitSubTask=2;//子任务
								return;
							}
						}
						y=Terminal_Router->TempCount;
						if(y>NUM_RMmax)
						{
							y=NUM_RMmax;
						}
						d64a=MRR((u32)&NoteList->List[y].Addr,6);
						p8s=(u8*)ADDR_6000_SDRAM;
						for(x=0;x<NUM_RMmax;x++)
						{
							if(p8s[0]==DataType_structure)
							{//有效
								p8d=p8s+5;
								p8d=Get_Element(p8d,4,0,0);//计算元素地址
								if(p8d)
								{
									z=(p8d[1]<<24)+(p8d[2]<<16)+(p8d[3]<<8)+p8d[4];//端口OAD
									z=OADtoPORTn(z);
									if(z==PORTn)
									{//端口号相同
										if(Terminal_Router->RouterRunMode_1!=3)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
										{//电力线载波
											d64b=MRR((u32)p8s+10,6);//取配置通信地址
											d64b=R_Inverse(d64b,6);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
											if(d64a==d64b)
											{//地址相同
												break;
											}
										}
										else
										{//微功率无线,档案地址用采集器地址
										#if SEL_RouterRunMode3ADDR==0//微功率无线发送帧目标地址:0=电能表地址，1=采集器地址
											d64b=MRR((u32)p8s+10,6);//取配置通信地址
											d64b=R_Inverse(d64b,6);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
											if(d64a==d64b)
											{//地址相同
												break;
											}
										#else
											d64b=MRR((u32)p8s+10,6);
											d64b=R_Inverse(d64b,6);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
											if(d64a==d64b)
											{//与通信地址相同
												p8d=Get_Element(p8s,3,0,0);//计算元素地址
												if(p8d==0)
												{//无采集器可取
													break;
												}
												//d64b=MRR((u32)p8d+5,6);//取配置采集器地址
												d64b=Get_TSA_Value(p8d+3);//得到TSA的不大于6字节通信地址,数据顺序不变,入口:p8=TSA类型后的字节，若无效值则=0
												d64b=R_Inverse(d64b,6);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
												y=Terminal_Router->TempCount;
												if(y>NUM_RMmax)
												{
													y=NUM_RMmax;
												}
												d64c=MRR((u32)&NoteList->List[y].CollectorAddr,6);
												if(((d64b==0xeeeeeeeeeeee)||(d64b==0))||(d64b==d64c))
												{//无采集器或采集器地址也相同
													break;
												}
											}
											else
											{
												p8d=Get_Element(p8s,3,0,0);//计算元素地址
												if(p8d)
												{
													//d64c=MRR((u32)p8d+5,6);//取配置采集器地址
													d64c=Get_TSA_Value(p8d+3);//得到TSA的不大于6字节通信地址,数据顺序不变,入口:p8=TSA类型后的字节，若无效值则=0
													d64c=R_Inverse(d64c,6);
													if(d64a==d64c)
													{//采集器地址相同
														NoteNum=Terminal_Router->NoteNum;
														if(NoteNum>NUM_RMmax)
														{
															NoteNum=NUM_RMmax;
														}
														for(y=0;y<NoteNum;y++)
														{
															d64c=MRR((u32)&NoteList->List[y].Addr,6);//列表中通信地址
															if(d64b==d64c)
															{
																break;
															}
														}
														if(y>=NoteNum)
														{//相同采集器地址的电表通信地址还无列表
															y=Terminal_Router->TempCount;
															if(y<NUM_RMmax)
															{
																MWR(d64b,(u32)&NoteList->List[y].Addr,6);//通信地址
															}
															break;
														}
													}
												}
											}
										#endif
										}
									}
								}
							}
							p8s+=LENper_6000;
						}
						if(x==NUM_RMmax)
						{//删除
							if(Terminal_Router->RouterRunMode_1!=3)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
							{//电力线载波
								x=p8tx[128];//有要删除的节点数
								y=Terminal_Router->TempCount;
								if(y>NUM_RMmax)
								{
									y=NUM_RMmax;
								}
								MR(((u32)p8tx)+128+1+(x*6),(u32)&NoteList->List[y].Addr,6);
								x++;//有要删除的节点数+1
								p8tx[128]=x;//有要删除的节点数
								if(x>=10)
								{
									//即发送,免其它任务影响p8tx+128后的数据
									Terminal_Router->RouterInitReCount=0;//命令重发计数
									Terminal_Router->RouterInitSubTask=2;//子任务
									return;
								}
							}
							else
							{
							#if SEL_RouterRunMode3ADDR==0//微功率无线发送帧目标地址:0=电能表地址，1=采集器地址
								x=p8tx[128];//有要删除的节点数
								y=Terminal_Router->TempCount;
								if(y>NUM_RMmax)
								{
									y=NUM_RMmax;
								}
								MR(((u32)p8tx)+128+1+(x*6),(u32)&NoteList->List[y].Addr,6);
								x++;//有要删除的节点数+1
								p8tx[128]=x;//有要删除的节点数
								if(x>=10)
								{
									//即发送,免其它任务影响p8tx+128后的数据
									Terminal_Router->RouterInitReCount=0;//命令重发计数
									Terminal_Router->RouterInitSubTask=2;//子任务
									return;
								}
							#else
								y=Terminal_Router->TempCount;
								if(y>NUM_RMmax)
								{
									y=NUM_RMmax;
								}
								d64b=MRR((u32)&NoteList->List[y].CollectorAddr,6);//取要删除的采集器地址
								if((d64b==0xeeeeeeeeeeee)||(d64b==0))
								{//无采集器地址
									x=p8tx[128];//有要删除的节点数
									MR(((u32)p8tx)+128+1+(x*6),(u32)&NoteList->List[y].Addr,6);
									x++;//有要删除的节点数+1
									p8tx[128]=x;//有要删除的节点数
									if(x>=10)
									{
										//即发送,免其它任务影响p8tx+128后的数据
										Terminal_Router->RouterInitReCount=0;//命令重发计数
										Terminal_Router->RouterInitSubTask=2;//子任务
										return;
									}
								}
								else
								{//采集器地址有效
									z=0;//清相同采集器地址计数
									NoteNum=Terminal_Router->NoteNum;
									if(NoteNum>NUM_RMmax)
									{
										NoteNum=NUM_RMmax;
									}
									for(y=0;y<NoteNum;y++)
									{
										d64c=MRR((u32)&NoteList->List[y].CollectorAddr,6);//列表中通信地址
										if(d64b==d64c)
										{
											z++;
											if(z>=2)
											{
												break;
											}
										}
									}
									if(z>=2)
									{//仅删除列表,不发送到模块
										if(NoteNum!=0)
										{
											z=Terminal_Router->TempCount;
											if(z>NUM_RMmax)
											{
												z=NUM_RMmax;
											}
											if(NoteNum>(z+1))
											{
												y=(NoteNum-(z+1))*LEN_NoteList;//从地址表中删去
												MR(ADDR_NoteList+(z*LEN_NoteList),ADDR_NoteList+((z+1)*LEN_NoteList),y);
											}
											Terminal_Router->NoteNum--;//当前路由器中总从节点数
											Terminal_Router->TempCount=0;//从0开始重新搜索
											return;
										}
									}
									else
									{
										x=p8tx[128];//有要删除的节点数
										y=Terminal_Router->TempCount;
										if(y>NUM_RMmax)
										{
											y=NUM_RMmax;
										}
										MR(((u32)p8tx)+128+1+(x*6),(u32)&NoteList->List[y].CollectorAddr,6);
										x++;//有要删除的节点数+1
										p8tx[128]=x;//有要删除的节点数
										if(x>=10)
										{
											//即发送,免其它任务影响p8tx+128后的数据
											Terminal_Router->RouterInitReCount=0;//命令重发计数
											Terminal_Router->RouterInitSubTask=2;//子任务
											return;
										}
									}
								}
							#endif
							}
						}
						Terminal_Router->TempCount++;
					}
					break;
				case 2://删除发送
				#if (USER/100)==0//电科院测试
					if(Terminal_Router->RouterRunMode_2==0)//路由运行模式_路由管理方式：0表示本地通信模块无路由管理功能，仅实现通信的调制解调功能，1表示本地通信模块带有路由管理功能
					{
						UARTCtrl->Task=0;//0=空闲,其他转发等插入操作
						goto DELACK;
					}
				#else
					if(Terminal_Router->RouterRunMode_3==0)//路由运行模式_测量点信息模式：0表示不需要下发测量点信息；1表示需要下发测量点信息
					{//0表示不需要下发测量点信息
						UARTCtrl->Task=0;//0=空闲,其他转发等插入操作
						goto DELACK;
					}
				#endif
					x=p8tx[128];//有要删除的节点数
					Uart_3762_TxData(PORTn,0x11,2,1+(x*6));//376.2发送数据填入发送区,入口时若有信息域目的地址数据单元等则已填入,数据单元暂固定填入发送缓冲区+128地址
					Terminal_Router->RouterInitSubTask++;//子任务
					break;
				case 3://删除接收
					switch(UARTCtrl->Task)//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
					{
						case 1://1=完成1帧发收
							UARTCtrl->Task=0;//0=空闲,其他转发等插入操作
							if(Get_Uart_3762_RxData_AFN_Fn(PORTn)==0x0001)//UART_3762接收数据得到AFN,Fn;B15-B8=AFN,B7-B0=Fn
							{//回答确认,删除
						DELACK:
								x=p8tx[128];//有要删除的节点数
								if(x>=10)
								{
									x=10;
								}
								for(i=0;i<x;i++)
								{
									d64a=MRR(((u32)p8tx)+128+1+(i*6),6);
									y=Terminal_Router->NoteNum;//当前路由器中总从节点数
									if(y>NUM_RMmax)
									{
										y=NUM_RMmax;
									}
									for(z=0;z<y;z++)
									{
										d64b=MRR((u32)&NoteList->List[z].Addr,6);
										if(d64a==d64b)
										{//找到要删去的地址
											NoteNum=Terminal_Router->NoteNum;
											if((NoteNum!=0)&&(NoteNum>=(z+1)))
											{
												y=(NoteNum-(z+1))*LEN_NoteList;//从地址表中删去
												MR(ADDR_NoteList+(z*LEN_NoteList),ADDR_NoteList+((z+1)*LEN_NoteList),y);
												Terminal_Router->NoteNum--;//当前路由器中总从节点数
												Terminal_Router->ModeNoteNum--;//从模块读取的模块返回从节点数(半字对齐)
											}
											break;
										}
										if(Terminal_Router->RouterRunMode_1==3)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
										{//小无线
										#if SEL_RouterRunMode3ADDR==0//微功率无线发送帧目标地址:0=电能表地址，1=采集器地址
											
										#else	
											d64b=MRR((u32)&NoteList->List[z].CollectorAddr,6);
											if(d64a==d64b)
											{//找到要删去的地址
												NoteNum=Terminal_Router->NoteNum;
												if((NoteNum!=0)&&(NoteNum>=(z+1)))
												{
													y=(NoteNum-(z+1))*LEN_NoteList;//从地址表中删去
													MR(ADDR_NoteList+(z*LEN_NoteList),ADDR_NoteList+((z+1)*LEN_NoteList),y);
													Terminal_Router->NoteNum--;//当前路由器中总从节点数
													Terminal_Router->ModeNoteNum--;//从模块读取的模块返回从节点数(半字对齐)
												}
												break;
											}
										#endif
										}
									}
								}
								p8tx[128]=0;//要删除数
								Terminal_Router->TempCount=0;//从0开始重新搜索
								Terminal_Router->RouterInitSubTask=1;//子任务
							}
							else
							{
								p16timer=(u16 *)Get_ADDR_UARTnTimer(PORTn);
								p16timer[0]=1000/10;//发送后接收超时定时值ms/10(半字对齐)
								UARTCtrl->RxByte=0;//RX计数(已接收字节数)=0
								UARTCtrl->Task=5;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
							}
							return;
						case 0://0=空闲
						case 2://2=接收超时(或错误)
							if(Terminal_Router->RouterInitReCount<2)
							{
								Terminal_Router->RouterInitReCount++;
								Terminal_Router->RouterInitSubTask=2;//子任务
							}
							else
							{
								Terminal_Router->NoteNum=0;//当前路由器中已知总从节点数
								Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
							}
							break;
					}
					break;
				default:
					Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
					break;
			}
			break;	
		case 5://添加从节点
			switch(Terminal_Router->RouterInitSubTask)
			{
				case 0://清删除或添加节点数计数
					Terminal_Router->NoteNumOver=0;//AFN04F10配置的从节点数>模块支持的最大从节点数;0=否,1=是
					Terminal_Router->TempCount=0;//删除或添加节点数计数
					p8tx[128]=0;//要添加数
					Terminal_Router->RouterInitSubTask++;//子任务
					break;
				case 1://查添加
					for(i=0;i<100;i++)
					{
						if(Terminal_Router->TempCount>=NUM_RMmax)
						{
							if(p8tx[128]==0)//有要删除的节点数
							{//没要添加
								Terminal_Router->RouterInitSubTask=0;//子任务
								Terminal_Router->RouterSynTask++;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
								return;
							}
							else
							{//有添加
								//即发送,免其它任务影响p8tx+128后的数据
								Terminal_Router->RouterInitReCount=0;//命令重发计数
								Terminal_Router->RouterInitSubTask=2;//子任务
								return;
							}
						}
						z=Terminal_Router->TempCount;
						if(z>NUM_RMmax)
						{
							z=NUM_RMmax;
						}
						p8s=(u8*)ADDR_6000_SDRAM+(LENper_6000*z);
						if(p8s[0]==DataType_structure)
						{//有效
							p8d=p8s+5;
							p8d=Get_Element(p8d,4,0,0);//计算元素地址
							if(p8d)
							{
								z=(p8d[1]<<24)+(p8d[2]<<16)+(p8d[3]<<8)+p8d[4];//端口OAD
								z=OADtoPORTn(z);
								if(z==PORTn)
								{//端口号相同
									d64a=MRR((u32)p8s+10,6);//取配置通信地址
									d64a=R_Inverse(d64a,6);
									d64b=MRR((u32)&Terminal_Router->RouterAddr,6);//主节点地址
									if(d64a!=d64b)
									{//电表地址!=主节点地址;有效
										if(d64a!=0xeeeeeeeeeeee)
										{//电表地址!=0xee;有效
											NoteNum=Terminal_Router->NoteNum;
											if(NoteNum>NUM_RMmax)
											{
												NoteNum=NUM_RMmax;
											}
											for(y=0;y<NoteNum;y++)
											{
												d64c=MRR((u32)&NoteList->List[y].Addr,6);
												if(d64a==d64c)
												{
													break;
												}
											}
											if(y==NoteNum)
											{//添加
												if(Terminal_Router->RouterRunMode_1==3)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
												{//微功率无线,档案地址用采集器地址
												#if SEL_RouterRunMode3ADDR==0//微功率无线发送帧目标地址:0=电能表地址，1=采集器地址
													
												#else
													p8d=Get_Element(p8s,3,0,0);//计算元素地址
													if(p8d)
													{
														//d64b=MRR((u32)p8d+5,6);//取配置采集器地址
														d64b=Get_TSA_Value(p8d+3);//得到TSA的不大于6字节通信地址,数据顺序不变,入口:p8=TSA类型后的字节，若无效值则=0
														d64b=R_Inverse(d64b,6);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
														if((d64b!=0xeeeeeeeeeeee)&&(d64b!=0))
														{//采集器地址有效
															for(y=0;y<NoteNum;y++)
															{
																d64c=MRR((u32)&NoteList->List[y].CollectorAddr,6);
																if(d64c==d64b)
																{
																	break;
																}
															}
															if(y!=NoteNum)
															{//采集器地址原已存在;仅增加列表,不写入模块
															AddNoTx:
																NoteNum=Terminal_Router->NoteNum;
																if(NoteNum>NUM_RMmax)
																{
																	NoteNum=NUM_RMmax;
																}
																if(NoteNum<NUM_RMmax)
																{
																	MC(0,ADDR_NoteList+(NoteNum*LEN_NoteList),LEN_NoteList);
																	MWR(d64a,(u32)&NoteList->List[NoteNum].Addr,6);
																	MWR(d64b,(u32)&NoteList->List[NoteNum].CollectorAddr,6);
																	Terminal_Router->NoteNum++;
																}
																Terminal_Router->TempCount++;
																continue;
															}
															d64a=d64b;//用采集器地址发给模块
														}
													}
												#endif
												}
												x=p8tx[128];//有要添加的节点数
												MWR(d64a,((u32)p8tx)+128+1+(x*7),6);
										//	规约类型  enum
										//	{
										//  	未知 (0)，
										//		DL/T645-1997（1），
										//		DL/T645-2007（2），
										//		DL/T698.45（3），
										//		CJ/T 188-2004（4）
										//	}
												p8d=p8s+5;
												p8d=Get_Element(p8d,3,0,0);//计算元素地址
												if(p8d==0)
												{
													y=0;
												}
												else
												{
													y=p8d[1];
												}
												switch(y)
												{
													case 1://DL/T645-1997（1）
														p8tx[128+1+(x*7)+6]=1;//通信协议类型
														break;
													case 2://DL/T645-2007（2）
														p8tx[128+1+(x*7)+6]=2;//通信协议类型
														break;
													case 3://DL/T698.45（3）
														if(Comm_Ram->RouterType==2)//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康,6=力合微,7=讯能,8=钱龙
														{//鼎信无698暂用透明
															p8tx[128+1+(x*7)+6]=0;//通信协议类型
														}
														else
														{
															p8tx[128+1+(x*7)+6]=3;//通信协议类型
														}
														break;
													case 4://CJ/T 188-2004（4）
													default://
														p8tx[128+1+(x*7)+6]=2;//通信协议类型
														break;
												}
												y=10;
												if(Terminal_Router->RouterRunMode_1==3)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
												{//微功率无线,档案地址用采集器地址
												#if SEL_RouterRunMode3ADDR==0//微功率无线发送帧目标地址:0=电能表地址，1=采集器地址
													
