gdgly/NUC97X_JS/STM32F4xx/DL698/RM_3762.c
												#else
													y=1;
													if(Terminal_Router->ModeNoteNum>=Terminal_Router->MaxNoteNum)
													{//模块中已有从节点数>=模块支持的最大从节点数
														//仅增加列表,不写入模块
														Terminal_Router->NoteNumOver=1;//AFN04F10配置的从节点数>模块支持的最大从节点数;0=否,1=是
														goto AddNoTx;
													}
												#endif
												}
												x++;//有要添加的节点数+1
												p8tx[128]=x;//有要添加的节点数
												if(x>=y)
												{
													//即发送,免其它任务影响p8tx+128后的数据
													Terminal_Router->RouterInitReCount=0;//命令重发计数
													Terminal_Router->RouterInitSubTask=2;//子任务
													return;
												}
											}
										}
									}
								}
							}
						}
						Terminal_Router->TempCount++;
					}
					break;
				case 2://添加发送
				#if (USER/100)==0//电科院测试
					if(Terminal_Router->RouterRunMode_2==0)//路由运行模式_路由管理方式：0表示本地通信模块无路由管理功能，仅实现通信的调制解调功能，1表示本地通信模块带有路由管理功能
					{
						UARTCtrl->Task=0;//0=空闲,其他转发等插入操作
						goto ADDACK;
					}
				#else
					if(Terminal_Router->RouterRunMode_3==0)//路由运行模式_测量点信息模式：0表示不需要下发测量点信息；1表示需要下发测量点信息
					{//0表示不需要下发测量点信息
						UARTCtrl->Task=0;//0=空闲,其他转发等插入操作
						goto ADDACK;
					}
				#endif
					x=p8tx[128];//有要添加的节点数
					Uart_3762_TxData(PORTn,0x11,1,1+(7*x));//376.2发送数据填入发送区,入口时若有信息域目的地址数据单元等则已填入,数据单元暂固定填入发送缓冲区+128地址
					Terminal_Router->RouterInitSubTask++;//子任务
					break;
				case 3://添加接收
					switch(UARTCtrl->Task)//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
					{
						case 1://1=完成1帧发收
							if(Get_Uart_3762_RxData_AFN_Fn(PORTn)==((0<<8)+1))//UART_3762接收数据得到AFN,Fn;B15-B8=AFN,B7-B0=Fn
							{//回答确认,添加
						ADDACK:
								x=p8tx[128];//有要添加的节点数
								if(x>=10)
								{
									x=10;
								}
								for(i=0;i<x;i++)
								{
									d64a=MRR(((u32)p8tx)+128+1+(i*7),6);
									for(z=0;z<NUM_RMmax;z++)
									{
										p8s=(u8*)ADDR_6000_SDRAM+(z*LENper_6000);
										if(p8s[0]==DataType_structure)
										{//测量点有效
											p8d=p8s+5;
											p8d=Get_Element(p8d,4,0,0);//计算元素地址
											if(p8d)
											{
												y=(p8d[1]<<24)+(p8d[2]<<16)+(p8d[3]<<8)+p8d[4];//端口OAD
												y=OADtoPORTn(y);
												if(y==PORTn)
												{//端口号相同
													d64b=MRR((u32)p8s+10,6);//取配置通信地址
													d64b=R_Inverse(d64b,6);
													if(d64a==d64b)
													{//找到要添加的04参数配置地址
														NoteNum=Terminal_Router->NoteNum;
														if(NoteNum<NUM_RMmax)
														{
															MC(0,ADDR_NoteList+(NoteNum*LEN_NoteList),LEN_NoteList);
															MWR(d64a,(u32)&NoteList->List[NoteNum].Addr,6);
															if(Terminal_Router->RouterRunMode_1==3)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
															{//微功率无线,档案地址用采集器地址
															#if SEL_RouterRunMode3ADDR==0//微功率无线发送帧目标地址:0=电能表地址，1=采集器地址
																
															#else
																p8d=Get_Element(p8s,3,0,0);//计算元素地址
																if(p8d)
																{
																	//d64b=MRR((u32)p8d+5,6);//取配置采集器地址
																	d64b=Get_TSA_Value(p8d+3);//得到TSA的不大于6字节通信地址,数据顺序不变,入口:p8=TSA类型后的字节，若无效值则=0
																	d64b=R_Inverse(d64b,6);
																	MWR(d64b,(u32)&NoteList->List[NoteNum].CollectorAddr,6);
																}
															#endif
															}
															Terminal_Router->NoteNum++;
															Terminal_Router->ModeNoteNum++;//从模块读取的模块返回从节点数(半字对齐)
														}
														break;
													}
													else
													{
														if(Terminal_Router->RouterRunMode_1==3)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
														{//微功率无线,档案地址用采集器地址
														#if SEL_RouterRunMode3ADDR==0//微功率无线发送帧目标地址:0=电能表地址，1=采集器地址
															
														#else
															p8d=Get_Element(p8s,3,0,0);//计算元素地址
															if(p8d)
															{
																//d64b=MRR((u32)p8d+5,6);//取配置采集器地址
																d64b=Get_TSA_Value(p8d+3);//得到TSA的不大于6字节通信地址,数据顺序不变,入口:p8=TSA类型后的字节，若无效值则=0
																d64b=R_Inverse(d64b,6);
																if(d64a==d64b)
																{//找到要添加的04参数配置地址
																	NoteNum=Terminal_Router->NoteNum;
																	if(NoteNum<NUM_RMmax)
																	{
																		MC(0,ADDR_NoteList+(NoteNum*LEN_NoteList),LEN_NoteList);
																		d64a=MRR((u32)p8s+10,6);//取配置通信地址
																		d64a=R_Inverse(d64a,6);
																		MWR(d64a,(u32)&NoteList->List[NoteNum].Addr,6);
																		MWR(d64b,(u32)&NoteList->List[NoteNum].CollectorAddr,6);
																		Terminal_Router->NoteNum++;
																		Terminal_Router->ModeNoteNum++;//从模块读取的模块返回从节点数(半字对齐)
																	}
																	break;
																}
															}
														#endif
														}
													}
												}
											}
										}
									}
								}
								p8tx[128]=0;//要添加数
								Terminal_Router->RouterInitSubTask=1;//子任务
							}
							else
							{
								p16timer=(u16 *)Get_ADDR_UARTnTimer(PORTn);
								p16timer[0]=1000/10;//发送后接收超时定时值ms/10(半字对齐)
								UARTCtrl->RxByte=0;//RX计数(已接收字节数)=0
								UARTCtrl->Task=5;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
							}
							return;
						case 0://0=空闲
						case 2://2=接收超时(或错误)
							if(Terminal_Router->RouterInitReCount<2)
							{
								Terminal_Router->RouterInitReCount++;
								Terminal_Router->RouterInitSubTask=2;//子任务
							}
							else
							{
								Terminal_Router->NoteNum=0;//当前路由器中已知总从节点数
								Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
							}
							break;
					}
					break;
				default:
					Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
					break;
			}
			break;
		case 6://查询从节点数量
		#if (USER/100)==0//电科院测试
			if(Terminal_Router->RouterRunMode_2==0)//路由运行模式_路由管理方式：0表示本地通信模块无路由管理功能，仅实现通信的调制解调功能，1表示本地通信模块带有路由管理功能
			{
				Terminal_Router->RouterSynTask++;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
				break;
			}
		#else
			if(Terminal_Router->RouterRunMode_3==0)//路由运行模式_测量点信息模式：0表示不需要下发测量点信息；1表示需要下发测量点信息
			{//0表示不需要下发测量点信息
				Terminal_Router->RouterSynTask++;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
				break;
			}
		#endif
			switch(Terminal_Router->RouterInitSubTask)
			{
				case 0://发送
					Uart_3762_TxData(PORTn,0x10,1,0);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
					Terminal_Router->RouterInitSubTask++;//子任务
					break;
				case 1://接收
					switch(UARTCtrl->Task)//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
					{
						case 1://1=完成1帧发收
							UARTCtrl->Task=0;//0=空闲,其他转发等插入操作
							if(Get_Uart_3762_RxData_AFN_Fn(PORTn)==0x1001)//UART_3762接收数据得到AFN,Fn;B15-B8=AFN,B7-B0=Fn
							{//AFN=10H,Fn=1
								x=p8rx[13]+(p8rx[14]<<8);
								if(Terminal_Router->RouterRunMode_1==3)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
								{//微功率无线
									y=Terminal_Router->ModeNoteNum;
									if(y!=x)
									{//模块节点数!=读取的节点数
										Terminal_Router->NoteNum=0;//同步错误
										Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
										return;
									}
								}
								else
								{//电力线载波
									if(Terminal_Router->NoteNum!=x)
									{//总已知节点数!=模块读取的节点数
										Terminal_Router->NoteNum=0;//同步错误
										Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
										return;
									}
								}
								Terminal_Router->ModeNoteNum=x;//从模块读取的模块返回从节点数(半字对齐)
								Terminal_Router->RouterInitReCount=0;//命令重发计数
								Terminal_Router->RouterInitSubTask=0;//子任务
								Terminal_Router->RouterSynTask++;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
							}
							else
							{
								p16timer=(u16 *)Get_ADDR_UARTnTimer(PORTn);
								p16timer[0]=1000/10;//发送后接收超时定时值ms/10(半字对齐)
								UARTCtrl->RxByte=0;//RX计数(已接收字节数)=0
								UARTCtrl->Task=5;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
							}
							break;
						case 0://0=空闲
						case 2://2=接收超时(或错误)
							if(Terminal_Router->RouterInitReCount<2)//命令重发计数
							{
								Terminal_Router->RouterInitReCount++;//命令重发计数
								Terminal_Router->RouterInitSubTask=0;//子任务=发送
							}
							else
							{
								Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
							}
							break;
					}
					break;
				default:
					Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
					break;
			}
			break;
		case 7://读取从节点信息
		#if (USER/100)==0//电科院测试
			if(Terminal_Router->RouterRunMode_2==0)//路由运行模式_路由管理方式：0表示本地通信模块无路由管理功能，仅实现通信的调制解调功能，1表示本地通信模块带有路由管理功能
			{
				Terminal_Router->RouterSynTask++;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
				break;
			}
		#else
			if(Terminal_Router->RouterRunMode_3==0)//路由运行模式_测量点信息模式：0表示不需要下发测量点信息；1表示需要下发测量点信息
			{//0表示不需要下发测量点信息
				Terminal_Router->RouterSynTask++;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
				break;
			}
		#endif
			switch(Terminal_Router->RouterInitSubTask)
			{
				case 0://清当前路由器中从节点数
					if(Terminal_Router->ModeNoteNum==0)//从模块读取的模块返回从节点数(半字对齐)
					{
						Terminal_Router->RouterSynTask++;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
						return;
					}
					Terminal_Router->TempCount=1;//删除或添加节点数计数(序号从1开始)
					Terminal_Router->ReadNoteNum=0;//档案同步时从模块已读取的节点数(半字对齐)
					Terminal_Router->RouterInitSubTask++;//子任务
					break;
				case 1://发送
					x=Terminal_Router->TempCount;
					MWR(x,((u32)p8tx)+128,2);//从节点起始序号
					p8tx[128+2]=10;//本次读10个
					Uart_3762_TxData(PORTn,0x10,2,3);//376.2发送数据填入发送区,入口时若有信息域目的地址数据单元等则已填入,数据单元暂固定填入发送缓冲区+128地址
					Terminal_Router->RouterInitSubTask++;//子任务
					break;
				case 2://接收
					switch(UARTCtrl->Task)//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
					{
						case 1://1=完成1帧发收
							UARTCtrl->Task=0;//0=空闲,其他转发等插入操作
							y=0;
							if(Get_Uart_3762_RxData_AFN_Fn(PORTn)==0x1002)//UART_3762接收数据得到AFN,Fn;B15-B8=AFN,B7-B0=Fn
							{//AFN=10H,Fn=2
								x=Terminal_Router->NoteNum;//已知总从节点数
								y=MRR(((u32)p8rx)+13+2,1);//本次读入从节点数
								Terminal_Router->TempCount+=y;
								Terminal_Router->ReadNoteNum+=y;//档案同步时从模块已读取的节点数(半字对齐)
								for(z=0;z<y;z++)
								{
									if((x+1)<=NUM_RMmax)
									{
										d64a=MRR(((u32)p8rx)+13+3+(z*8),6);
										for(i=0;i<x;i++)
										{
											d64b=MRR((u32)&NoteList->List[i].Addr,6);
											if(d64a==d64b)
											{
												break;//原已存在
											}
										}
										if(i==x)
										{//原没存在
											if(Terminal_Router->RouterRunMode_1!=3)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
											{
												//添加册除错误
												Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
												return;
											}
											else
											{//微功率无线,档案地址用采集器地址
											#if SEL_RouterRunMode3ADDR==0//微功率无线发送帧目标地址:0=电能表地址，1=采集器地址
												//添加册除错误
												Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
												return;
											#else
												for(i=0;i<x;i++)
												{
													d64b=MRR((u32)&NoteList->List[i].CollectorAddr,6);
													if(d64a==d64b)
													{
														break;//原已存在
													}
												}
												if(i==x)
												{//原没存在
													//添加册除错误
													Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
													return;
												}
											#endif
											}
										}
									}
								}
							}
							else
							{
								p16timer=(u16 *)Get_ADDR_UARTnTimer(PORTn);
								p16timer[0]=1000/10;//发送后接收超时定时值ms/10(半字对齐)
								UARTCtrl->RxByte=0;//RX计数(已接收字节数)=0
								UARTCtrl->Task=5;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
								return;
							}
							if((Terminal_Router->TempCount<=NUM_RMmax)&&(Terminal_Router->ReadNoteNum<Terminal_Router->ModeNoteNum))
							{//继续读
								if(y==0)
								{
									Terminal_Router->TempCount+=10;//下开始序号从下10个开始
								}
								Terminal_Router->RouterInitSubTask=1;
							}
							else
							{//读结束
								Terminal_Router->RouterInitReCount=0;//命令重发计数
								Terminal_Router->RouterInitSubTask=0;//子任务
								Terminal_Router->RouterSynTask++;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
							}
							break;
						case 0://0=空闲
						case 2://2=接收超时(或错误)
							if(Terminal_Router->RouterInitReCount<2)//命令重发计数
							{
								Terminal_Router->RouterInitReCount++;//命令重发计数
								Terminal_Router->RouterInitSubTask=1;//子任务=发送
							}
							else
							{
								Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
							}
							break;
					}
					break;
				default:
					Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
					break;
			}
			break;
		case 8://恢复路由
			if(Terminal_Router->RouterInitTask>=200)//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
			{
				Terminal_Router->StopFlags&=~(1<<8);//恢复路由
				Terminal_Router->RouterCtrl=3;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
				
		//------
//			#if RM_HPLC_Concurrency==0//0=否,1=是;宽带载波集中器主动并发抄表
//				if(Terminal_Router->RouterRunMode_4!=1)//路由运行模式_周期抄表模式:01表示通信模块仅支持集中器主导的周期抄表模式，10表示通信模块仅支持路由主导的周期抄表模式；11表示通信模块对两种抄表模式都支持；00保留
//			#else
//				if(Terminal_Router->RouterRunMode_4==2)//路由运行模式_周期抄表模式:01表示通信模块仅支持集中器主导的周期抄表模式，10表示通信模块仅支持路由主导的周期抄表模式；11表示通信模块对两种抄表模式都支持；00保留
//			#endif
//				{//10仅支持路由主导的周期抄表模式
//					//Terminal_Router->RouterCtrl=3;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
//				}
//				else
//				{//01,03表示通信模块仅支持集中器主导的周期抄表模式;或主动上报
//					i=Terminal_Router->RouterRunMode_1;
//				#if RM_HPLC_Concurrency==0//0=否,1=是;宽带载波集中器主动并发抄表
//					if(i==3)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
//				#else
//					if(i!=1)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
//				#endif
//					{//微功率无线,需路由学习完成后才能抄表,否则直接返回否认
//						Terminal_Router->RUNState=0;//当前路由运行状态(从模块中读取值):b2=上报事件标志,b1=工作标志,b0=路由完成标志
//						Terminal_Router->RouterCtrl=6;//路由器控制命令0=空,1=重启,2=暂停,3=恢复延时,4=读状态,5=恢复,6=启动组网;完成后自动回到0
//					}
//				}
		//------
				
