gdgly/NUC97X_JS/STM32F4xx/DL698/RM_3762.c
			}
			Terminal_Router->RouterSynTask=0;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
			break;
	}
}




void Terminal_RouterCtrl(u32 PORTn)//路由器控制命令0=空,1=重启,2=暂停,3=恢复延时,4=读状态,5=恢复,6=启动组网;完成后自动回到0
{
	u32 i;
	u8 *p8rx;
	u16 *p16timer;
	UARTCtrl_TypeDef * UARTCtrl;
	//ms_Type *ms;
#if(USER/100)==17//江苏系
	#ifdef DEBUG_JSON
	u32 ii;
	#endif
	u32 x;
	u32 y;
	u32 z;
	u32 m;
	u32 n;
	u64 d64a;
	u64 d64b;
	u8 *p8tx;
	p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
#endif
	
	//ms=Get_ms();
	
	if(Terminal_Router->RouterCtrl==0)//路由器控制命令0=空,1=重启,2=暂停,3=恢复延时,4=读状态,5=恢复,6=启动组网;完成后自动回到0
	{
		return;
	}
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	if((UARTCtrl->Task==3)||(UARTCtrl->Task==4))//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
	{
		return;//正在发送(主动上报时可能有这种情况,但不很确定,加上再说)
	}
	//if(Terminal_Router->RouterRunMode_2==0)//路由运行模式_路由管理方式：0表示本地通信模块无路由管理功能，仅实现通信的调制解调功能，1表示本地通信模块带有路由管理功能
#if RM_HPLC_Concurrency==0//0=否,1=是;宽带载波集中器主动并发抄表
	if(Terminal_Router->RouterRunMode_4==1)//路由运行模式_周期抄表模式：01表示通信模块仅支持集中器主导的周期抄表模式，10表示通信模块仅支持路由主导的周期抄表模式；11表示通信模块对两种抄表模式都支持；00保留
#else
	if(Terminal_Router->RouterRunMode_4!=2)//路由运行模式_周期抄表模式：01表示通信模块仅支持集中器主导的周期抄表模式，10表示通信模块仅支持路由主导的周期抄表模式；11表示通信模块对两种抄表模式都支持；00保留
#endif
	{
		#if(USER/100)==17//江苏系
		if((Terminal_Router->RouterCtrl!=4)&&(Terminal_Router->RouterCtrl!=6)&&(Terminal_Router->RouterCtrl!=7))//路由器控制命令0=空,1=重启,2=暂停,3=恢复延时,4=读状态,5=恢复,6=启动组网;完成后自动回到0
		#else
		if((Terminal_Router->RouterCtrl!=4)&&(Terminal_Router->RouterCtrl!=6))//路由器控制命令0=空,1=重启,2=暂停,3=恢复延时,4=读状态,5=恢复,6=启动组网;完成后自动回到0
		#endif
		{
			if(Terminal_Router->RouterCtrl==1)//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
			{
				Terminal_Router->StopFlags=0;//暂停路由标志
//			#if (USER/100)!=0//微功率无线电科院送样不重新组网,以免影响抄表成功率测试
//				if(Terminal_Router->RouterInitTask>=200)
//				{
//					if(Terminal_Router->RouterRunMode_1==3)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
//					{//微功率无线
//						if((Terminal_Router->RUNState&1)!=0)//当前路由运行状态(从模块中读取值):b2=上报事件标志,b1=工作标志,b0=路由完成标志
//						{//当前不是正在组网
//							if((Comm_Ram->DL698YMDHMS[4]<=6)||(Comm_Ram->DL698YMDHMS[4]>=20))
//							{//在时钟0-6点或20点-24点启动重新组网
//								//UARTCtrl->Task=0;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
//								Terminal_Ram->RouterCheck_S_Timer=(10*60);//载波路由器死机秒定时值
//								Terminal_Router->RouterCtrlTask=0;//路由器控制任务计数;完成后自动回到0
//								Terminal_Router->RouterCtrl=6;//路由器控制命令0=空,1=重启,2=暂停,3=恢复延时,4=读状态,5=恢复,6=启动组网;完成后自动回到0
//								return;
//							}
//						}
//					}
//				}
//			#endif
			}
			//UARTCtrl->Task=0;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
			Terminal_Ram->RouterCheck_S_Timer=(10*60);//载波路由器死机秒定时值
			Terminal_Router->RouterCtrlTask=0;//路由器控制任务计数;完成后自动回到0
			Terminal_Router->RouterCtrl=0;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
			return;
		}
	}

	p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
	switch(Terminal_Router->RouterCtrl)//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
	{//路由控制
		case 0://空
			break;
		case 1://重启
			Terminal_Ram->RouterCheck_S_Timer=RouterCheckTimerVal;//(60*10)//载波路由器死机秒定时值
			switch(Terminal_Router->RouterCtrlTask)//路由器控制任务计数;完成后自动回到0
			{
				case 0:
					//重启在过整点冻结后进行,仅电科院测试需要,过整点重启后路由请求数据时要求6秒内响应,但当前整点冻结时间约需3秒
					i=MRR(ADDR_MYMDHMS,2);
					if(i<0x0003)
					{//过整点后时钟分秒<00分03秒或正在冻结
						break;
					}
					Terminal_Router->ReRouterCtrl=0;//路由器控制重发计数
					Uart_3762_TxData(PORTn,0x12,1,0);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
					Terminal_Router->RouterCtrlTask++;//路由器控制任务计数;完成后自动回到0
					break;
				case 1:
					switch(UARTCtrl->Task)//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
					{
						case 1://1=完成1帧发收
							UARTCtrl->Task=0;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
							if((Get_Uart_3762_RxData_AFN_Fn(PORTn)==0x0001)&&((p8rx[4]&0x4)==0))//UART_3762接收数据得到AFN,Fn;B15-B8=AFN,B7-B0=Fn
							{
								Terminal_Router->RouterCtrlTask=0;//路由器控制任务计数;完成后自动回到0
								Terminal_Router->StopFlags=0;//暂停路由标志
								Terminal_Router->RouterCtrl=4;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
								//下条仅为电科院测试去了读状态而增加的
								Terminal_Router->RUNState|=2;//当前路由运行状态(从模块中读取值):b2=上报事件标志,b1=工作标志,b0=路由完成标志
								break;
							}
							else
							{
								p16timer=(u16 *)Get_ADDR_UARTnTimer(PORTn);
								p16timer[0]=1000/10;//发送后接收超时定时值ms/10(半字对齐)
								UARTCtrl->RxByte=0;//RX计数(已接收字节数)=0
								UARTCtrl->Task=5;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
							}
							break;
						case 0://0=空闲
						case 2://2=接收超时(或错误)
							if(Terminal_Router->ReRouterCtrl<2)//路由器控制重发计数
							{
								Terminal_Router->ReRouterCtrl++;
								Uart_3762_TxData(PORTn,0x12,1,0);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
							}
							else
							{
								Terminal_Router->RouterCtrlTask=0;//路由器控制任务计数;完成后自动回到0
								Terminal_Router->RouterCtrl=4;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
								//东软路由配置数=0时重启和恢复错误
								if(Terminal_Router->NoteNum!=0)
								{//节点表!=0
									Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
								}
							}
							break;
					}
					break;
				default:
					Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
					break;
			}
			break;
		case 2://暂停
			switch(Terminal_Router->RouterCtrlTask)//路由器控制任务计数;完成后自动回到0
			{
				case 0:
					if(Terminal_Router->RouterInitTask>=200)//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
					{
						if((Terminal_Router->RUNState&2)==0)//当前路由运行状态(从模块中读取值):b2=上报事件标志,b1=工作标志,b0=路由完成标志
						{//本就是暂停
							Terminal_Router->RouterCtrlTask=0;//路由器控制任务计数;完成后自动回到0
							Terminal_Router->RouterCtrl=4;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
							break;
						}
					}
					Terminal_Router->ReRouterCtrl=0;//路由器控制重发计数
					Uart_3762_TxData(PORTn,0x12,2,0);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
					Terminal_Router->RouterCtrlTask++;//路由器控制任务计数;完成后自动回到0
					break;
				case 1:
					switch(UARTCtrl->Task)//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
					{
						case 1://1=完成1帧发收
							UARTCtrl->Task=0;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
							if((Get_Uart_3762_RxData_AFN_Fn(PORTn)==0x0001)&&((p8rx[4]&0x4)==0))//UART_3762接收数据得到AFN,Fn;B15-B8=AFN,B7-B0=Fn
							{
								Terminal_Router->RouterCtrlTask=0;//路由器控制任务计数;完成后自动回到0
								Terminal_Router->RouterCtrl=4;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
								//下条仅为电科院测试去了读状态而增加的
								Terminal_Router->RUNState&=0xfd;//当前路由运行状态(从模块中读取值):b2=上报事件标志,b1=工作标志,b0=路由完成标志
								break;
							}
							else
							{
								p16timer=(u16 *)Get_ADDR_UARTnTimer(PORTn);
								p16timer[0]=1000/10;//发送后接收超时定时值ms/10(半字对齐)
								UARTCtrl->RxByte=0;//RX计数(已接收字节数)=0
								UARTCtrl->Task=5;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
							}
							break;
						case 0://0=空闲
						case 2://2=接收超时(或错误)
							if(Terminal_Router->ReRouterCtrl<2)//路由器控制重发计数
							{
								Terminal_Router->ReRouterCtrl++;
								Uart_3762_TxData(PORTn,0x12,2,0);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
							}
							else
							{
								Terminal_Router->RouterCtrl=0;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
								Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
							}
							break;
					}
					break;
				default:
					Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
					break;
			}
			break;
		case 3://延时恢复
			if(Terminal_Router->StopFlags!=0)//暂停路由标志
			{//还有其它需暂停
				Terminal_Ram->RouterCtrl_MS_Timer=0;//5000/100;//16 路由控制恢复延时 10MS定时器
			}
			else
			{
			#if (USER/100)==0
				Terminal_Ram->RouterCtrl_MS_Timer=0;//5000/100;//16 路由控制恢复延时 10MS定时器
			#else
				if(Comm_Ram->RouterType==2)//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康
				{//鼎信100s
					Terminal_Ram->RouterCtrl_MS_Timer=100000/10;//16 路由控制恢复延时 10MS定时器
				}
				else
				{//其他30s
					Terminal_Ram->RouterCtrl_MS_Timer=30000/10;//16 路由控制恢复延时 10MS定时器
				}
			#endif
			}
			UARTCtrl->Task=0;//置为0=空闭,以便马上再行转发等
			Terminal_Router->RouterCtrl=0;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
			Terminal_Router->RouterCtrlTask=0;//路由器控制任务计数;完成后自动回到0
			//下条置当前路由运行状态=0仅为麦希路由时需要,因暂停路由后读状态仍为运行需恢复动作再次读取状态以判断学习状态
			Terminal_Router->RUNState=0;//当前路由运行状态(从模块中读取值):b2=上报事件标志,b1=工作标志,b0=路由完成标志
			break;
		case 5://立即恢复
			Terminal_Ram->RouterCheck_S_Timer=RouterCheckTimerVal;//(60*10)//载波路由器死机秒定时值
			switch(Terminal_Router->RouterCtrlTask)//路由器控制任务计数;完成后自动回到0
			{
				case 0:
					if(Terminal_Router->StopFlags!=0)//暂停路由标志
					{//还有其它需暂停
						Terminal_Router->RouterCtrl=0;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
						break;
					}
					Terminal_Router->ReRouterCtrl=0;//路由器控制重发计数
					Uart_3762_TxData(PORTn,0x12,3,0);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
					Terminal_Router->RouterCtrlTask++;//路由器控制任务计数;完成后自动回到0
					break;
				case 1:
					switch(UARTCtrl->Task)//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
					{
						case 1://1=完成1帧发收
							UARTCtrl->Task=0;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
							if((Get_Uart_3762_RxData_AFN_Fn(PORTn)==0x0001)&&((p8rx[4]&0x4)==0))//UART_3762接收数据得到AFN,Fn;B15-B8=AFN,B7-B0=Fn
							{
								Terminal_Router->RouterCtrlTask=0;//路由器控制任务计数;完成后自动回到0
								Terminal_Router->RouterCtrl=4;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
								//下条仅为电科院测试去了读状态而增加的
								Terminal_Router->RUNState|=2;//当前路由运行状态(从模块中读取值):b2=上报事件标志,b1=工作标志,b0=路由完成标志
								break;
							}
							else
							{
								p16timer=(u16 *)Get_ADDR_UARTnTimer(PORTn);
								p16timer[0]=1000/10;//发送后接收超时定时值ms/10(半字对齐)
								UARTCtrl->RxByte=0;//RX计数(已接收字节数)=0
								UARTCtrl->Task=5;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
							}
							break;
						case 0://0=空闲
						case 2://2=接收超时(或错误)
							if(Terminal_Router->ReRouterCtrl<2)//路由器控制重发计数
							{
								Terminal_Router->ReRouterCtrl++;
								Uart_3762_TxData(PORTn,0x12,3,0);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
							}
							else
							{
								Terminal_Router->RouterCtrlTask=0;//路由器控制任务计数;完成后自动回到0
								Terminal_Router->RouterCtrl=4;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
								//东软路由配置数=0时重启和恢复错误
								if(Terminal_Router->NoteNum!=0)
								{//节点表!=0
									Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
								}
							}
							break;
					}
					break;
				default:
					Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
					break;
			}
			break;
		case 4://读状态
			if(Terminal_Router->RouterRunMode_1==1)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
			{//窄带电力线
				Terminal_Router->RUNState|=1;//当前路由运行状态(从模块中读取值):b2=上报事件标志,b1=工作标志,b0=路由完成标志
				Terminal_Router->RouterCtrl=0;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
				Terminal_Router->RouterCtrlTask=0;//路由器控制任务计数;完成后自动回到0
			}
			else
			{//宽带电力线,小无线
				switch(Terminal_Router->RouterCtrlTask)//路由器控制任务计数;完成后自动回到0
				{
					case 0:
						Terminal_Router->ReRouterCtrl=0;//路由器控制重发计数
						Uart_3762_TxData(PORTn,0x10,4,0);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
						Terminal_Router->RouterCtrlTask++;//路由器控制任务计数;完成后自动回到0
						break;
					case 1:
						switch(UARTCtrl->Task)//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
						{
							case 1://1=完成1帧发收
								UARTCtrl->Task=0;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
								if((Get_Uart_3762_RxData_AFN_Fn(PORTn)==0x1004)&&((p8rx[4]&0x4)==0))//UART_3762接收数据得到AFN,Fn;B15-B8=AFN,B7-B0=Fn
								{
									//取当前运行状态
									i=p8rx[13];
									Terminal_Router->RUNState=i;//当前路由运行状态(从模块中读取值):b2=上报事件标志,b1=工作标志,b0=路由完成标志
									//
									Terminal_Router->RouterCtrl=0;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
									Terminal_Router->RouterCtrlTask=0;//路由器控制任务计数;完成后自动回到0
								#if(USER/100)==17//江苏系
									if(Terminal_Router->RUNState==1)//组网完成
									{
										Terminal_Router->RouterCtrl=7;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
										Terminal_Router->RouterCtrlTask=0;//路由器控制任务计数;完成后自动回到0
										Terminal_Router->TempCount=1;
										Terminal_Router->MinuteCollect=1;//先默认支持分钟级数据采集
										Terminal_Ram->PORT0_S_Timer=480;//组网完成之后6分钟
										WarningOccur(PORTn,(u8 *)"等待读取节点信息");//告警发生,入口告警代码和告警字符串
										//Start_AutoSearchMet(PORTn);
									}
								#endif
									break;
								}
								else
								{
									#ifdef DEBUG_JSON
									myprintf("[%s:%d]:10f4路由学习状态查看失败\n",(u32)__func__,(u32)__LINE__,0);
									#endif
									p16timer=(u16 *)Get_ADDR_UARTnTimer(PORTn);
									p16timer[0]=1000/10;//发送后接收超时定时值ms/10(半字对齐)
									UARTCtrl->RxByte=0;//RX计数(已接收字节数)=0
									UARTCtrl->Task=5;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
								}
								break;
							case 0://0=空闲
							case 2://2=接收超时(或错误)
								i=2;
								if(Comm_Ram->RouterType==102)//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康,6=力合微,7=;100=保留,101=麦希,102=友讯达,103=有方
								{//友讯达在组网时会不响应
									i=20;
								}
								if(Terminal_Router->ReRouterCtrl<i)//路由器控制重发计数
								{
									Terminal_Router->ReRouterCtrl++;
									Uart_3762_TxData(PORTn,0x10,4,0);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
								}
								else
								{
									Terminal_Router->RouterCtrl=0;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
									Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
								}
								break;
						}
						break;
					default:
						Terminal_Router->RouterCtrl=0;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
						Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
						break;
				}
			}
			break;
		case 6://启动组网
			switch(Terminal_Router->RouterCtrlTask)//路由器控制任务计数;完成后自动回到0
			{
				case 0:
					Terminal_Router->ReRouterCtrl=0;//路由器控制重发计数
					Uart_3762_TxData(PORTn,0x11,102,0);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
					Terminal_Router->RouterCtrlTask++;//路由器控制任务计数;完成后自动回到0
					break;
				case 1:
					switch(UARTCtrl->Task)//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
					{
						case 1://1=完成1帧发收
							UARTCtrl->Task=0;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
							if((Get_Uart_3762_RxData_AFN_Fn(PORTn)==0x0001)&&((p8rx[4]&0x4)==0))//UART_3762接收数据得到AFN,Fn;B15-B8=AFN,B7-B0=Fn
							{
								Terminal_Router->RouterCtrlTask=0;//路由器控制任务计数;完成后自动回到0
								Terminal_Router->RouterCtrl=4;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
								break;
							}
							else
							{
								p16timer=(u16 *)Get_ADDR_UARTnTimer(PORTn);
								p16timer[0]=1000/10;//发送后接收超时定时值ms/10(半字对齐)
								UARTCtrl->RxByte=0;//RX计数(已接收字节数)=0
								UARTCtrl->Task=5;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
							}
							break;
						case 0://0=空闲
						case 2://2=接收超时(或错误)
							if(Terminal_Router->ReRouterCtrl<2)//路由器控制重发计数
							{
								Terminal_Router->ReRouterCtrl++;
								Uart_3762_TxData(PORTn,0x11,102,0);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
							}
							else
							{
								Terminal_Router->RouterCtrlTask=0;//路由器控制任务计数;完成后自动回到0
							}
							break;
					}
					break;
				default:
					Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
					break;
			}
			break;
			
	#if(USER/100)==17//江苏系
		case 7://读从节点信息
//			#if (USER/100)==0//电科院测试
//			if(Terminal_Router->RouterRunMode_2==0)//路由运行模式_路由管理方式：0表示本地通信模块无路由管理功能，仅实现通信的调制解调功能，1表示本地通信模块带有路由管理功能
//			{
//				Terminal_Router->RouterSynTask++;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
//				break;
//			}
//		#else
//			if(Terminal_Router->RouterRunMode_3==0)//路由运行模式_测量点信息模式：0表示不需要下发测量点信息；1表示需要下发测量点信息
//			{//0表示不需要下发测量点信息
//				Terminal_Router->RouterSynTask++;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
//				break;
//			}
//		#endif
		
		
			if(Terminal_Ram->PORT0_S_Timer!=0)
			{
				return;
			}	
			//if(UARTCtrl->AutoSearchTask>=1)
			//{
				//return;
			//}
//			myprintf("[%s:%d]:Terminal_Router->ReadNoteNum====%d  ",(u32)&__func__,(u32)__LINE__,Terminal_Router->ReadNoteNum);
			switch(Terminal_Router->RouterInitSubTask)//路由器控制任务计数;完成后自动回到0
			{
				case 0://清当前路由器中从节点数
//					if(Terminal_Router->ModeNoteNum==0)//从模块读取的模块返回从节点数(半字对齐)
//					{
//						Terminal_Router->RouterSynTask++;//档案同步任务;0=空闲,1=等待启动,2-n同步过程完成后回0
//						return;
//					}
					Terminal_Router->TempCount=1;//删除或添加节点数计数(序号从1开始)
					Terminal_Router->ReadNoteNum=0;//档案同步时从模块已读取的节点数(半字对齐)
					Terminal_Router->RouterInitSubTask++;//子任务				
					break;
				case 1:
					x=Terminal_Router->TempCount;
					MWR(x,((u32)p8tx)+128,2);//从节点起始序号
					p8tx[128+2]=10;//本次读10个
					Terminal_Router->ReRouterCtrl=0;//路由器控制重发计数
					Uart_3762_TxData(PORTn,0x10,7,3);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
					Terminal_Router->RouterInitSubTask++;//路由器控制任务计数;完成后自动回到0
					break;
				case 2:
					switch(UARTCtrl->Task)//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
					{
						case 1://1=完成1帧发收
							UARTCtrl->Task=0;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
							#ifdef DEBUG_JSON
							myprintf("[%s:%d]:10f7上报从节点信息\n",(u32)__func__,(u32)__LINE__,0);
							for(i=0;i<120;i++)
							{	
								myprintf("%02x ",p8rx[i],0,0);
							}
							myprintf("\n",0,0,0);
							#endif
							if(Get_Uart_3762_RxData_AFN_Fn(PORTn)==0x1007)
							{//AFN=10H,Fn=7,江苏扩展功能
								x=Terminal_Router->NoteNum;//已知总从节点数
								y=MRR(((u32)p8rx)+13+2,1);//本次读入从节点数
								Terminal_Router->TempCount+=y;//下开始序号
								Terminal_Router->ReadNoteNum+=y;//档案同步时从模块已读取的节点数(半字对齐)
								m=0;
								n=0;
								//p8d=(u8*)ADDR_AFN10F7;
								for(z=0;z<y;z++)
								{
									if((x+1)<=NUM_RMmax)
									{
										d64a=MRR(((u32)p8rx)+13+3+m,6);
										//n=MRR(((u32)p8rx)+13+3+m+9,1);//从节点z节点模块ID号长度
										n=MRR(((u32)p8rx)+13+3+m+6,1);//从节点z节点类型
										//m+=(11+n);
										for(i=0;i<x;i++)
										{
											d64b=MRR((u32)&NoteList->List[i].Addr,6);
											if(d64a==d64b)
											{
												if((n&0x10)==0)
												{
													#ifdef DEBUG_JSON
													myprintf("[%s:%d]:有电表不支持分数数据采集\n",(u32)&__func__,(u32)__LINE__,0);
													for(ii=6;ii>0;ii--)
													{	
														myprintf("%02x ",NoteList->List[i].Addr[ii-1],0,0);
													}
													myprintf("\n",0,0,0);
													#endif
													Terminal_Router->MinuteCollect=0;//从节点不支持分钟级采集
												}
												n=MRR(((u32)p8rx)+13+3+m+9,1);//从节点z节点模块ID号长度
												m+=(11+n);
												break;//原已存在
											}
											if(i==x)
											{//原没存在
												if((n&0x10)==0)
												{
													#ifdef DEBUG_JSON
													myprintf("[%s:%d]:有原没存在的电表不支持分数数据采集\n",(u32)&__func__,(u32)__LINE__,0);
													for(ii=6;ii>0;ii--)
													{	
														myprintf("%02x  ",NoteList->List[i].Addr[ii-1],0,0);
													}
													myprintf("\n",0,0,0);
													#endif
													Terminal_Router->MinuteCollect=0;//从节点不支持分钟级采集
												}
												n=MRR(((u32)p8rx)+13+3+m+9,1);//从节点z节点模块ID号长度
												m+=(11+n);
												if(Terminal_Router->RouterRunMode_1!=3)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
												{//电力线载波表
//													UARTCtrl->Task=0;
//													Terminal_RouterSyn(PORTn);//路由器档案同步
//													MC(0,(u32)&NoteList->List[x],LEN_NoteList);
//													MWR(d64a,(u32)&NoteList->List[x].Addr,6);
//													x++;
//													Terminal_Router->NoteNum=x;//当前路由器中总从节点数
												}
												else
												{//微功率无线,档案地址用采集器地址
													for(i=0;i<x;i++)
													{
														if((n&0x0f)==1)//采集器模块
															d64b=MRR((u32)&NoteList->List[i].CollectorAddr,6);
														else
															d64b=MRR((u32)&NoteList->List[i].Addr,6);
														if(d64a==d64b)
														{
															break;//原已存在
														}
													}
													if(i==x)
													{//原没存在
														MC(0,(u32)&NoteList->List[x],LEN_NoteList);
														MWR(d64a,(u32)&NoteList->List[x].Addr,6);
														if((n&0x0f)==1)//采集器模块
															MWR(d64a,(u32)&NoteList->List[x].CollectorAddr,6);//采集器地址
														x++;
														Terminal_Router->NoteNum=x;//当前路由器中总从节点数
													}
												}
											}
										}
									}
								}
							}
							else
							{
								p16timer=(u16 *)Get_ADDR_UARTnTimer(PORTn);
								p16timer[0]=1000/10;//发送后接收超时定时值ms/10(半字对齐)
								UARTCtrl->RxByte=0;//RX计数(已接收字节数)=0
								UARTCtrl->Task=5;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
							}
							if((Terminal_Router->TempCount<=NUM_RMmax)&&(Terminal_Router->ReadNoteNum<Terminal_Router->ModeNoteNum))
							{//继续读
								if(y==0)
								{
									Terminal_Router->TempCount+=10;//下开始序号从下10个开始
								}
								Terminal_Router->RouterInitSubTask=1;
							}
							else
							{//读结束
								Terminal_Router->RouterCtrl=0;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
								Terminal_Router->RouterCtrlTask=0;//路由器控制任务计数;完成后自动回到0
								Terminal_Router->RouterInitReCount=0;//命令重发计数
								#ifdef DEBUG_JSON
								myprintf("\n[%s:%d]:Terminal_Router->NoteNum=%d \n", (u32)&__func__, __LINE__, Terminal_Router->NoteNum);
								#endif
								i=Terminal_Router->MinuteCollect;
								if(i)
								{
									WarningOccur(PORTn,(u8 *)"支持分钟采集");//告警发生,入口告警代码和告警字符串
									Start_AutoSearchMet(PORTn,10);//启动搜表
								}
								#ifdef DEBUG_JSON
								if(i)
								{
									myprintf("\n********************************************\n", 0, 0, 0);
									myprintf("*****从节点信息查询完成开始分钟级数据采集*****\n", 0, 0, 0);
									myprintf("**********************************************\n", 0, 0, 0);
								}
								#endif
								/*
								m=Terminal_Router->MinuteCollect;
								d64a=0;
								for(z=0;z<Terminal_Router->NoteNum1;z++)
								{
									d64a=MRR((u32)&NoteList1->List1[z].CollectorAddr,6);
									if(d64a==0)
										break;
									if(d64b==d64a)
									{
										NoteList1->List1[z].user=0;
									}
									else
									{
										d64b=d64a;
										NoteList1->List1[z].user=1;
									}
								}
								*/
							}
							break;
						case 0://0=空闲
						case 2://2=接收超时(或错误)
							if(Terminal_Router->ReRouterCtrl<2)//路由器控制重发计数
							{
								Terminal_Router->ReRouterCtrl++;
								Uart_3762_TxData(PORTn,0x10,7,3);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
							}
							else
							{
								Terminal_Router->RouterInitSubTask=0;//路由器控制任务计数;完成后自动回到0
								Terminal_Router->RouterCtrl=4;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
							}
							break;
					}
					break;
				default:
					Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
					break;
			}
			break;
	#endif
		default:
			Terminal_Router->RouterInitTask=0;//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
			break;
	}
}



