gdgly/NUC97X_JS/STM32F4xx/DL698/RM_3762.c
/*
void RouterBroadcastTime(u32 PORTn)//广播校时0=空,1=,2=,3=命令,4=过程...,完成后自动回到0
{
	u32 i;
	u32 x;
	u64 d64;
	u8 *p8rx;
	u8 *p8tx;
	u16 * p16timer;
	UARTCtrl_TypeDef * UARTCtrl;
	
	if(Terminal_Router->RouterInitTask<200)//路由器抄读任务0-99公共初始化,100-199分厂家初始化,>=200路由抄表
	{
		return;
	}
	p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
	p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
	p16timer=(u16 *)Get_ADDR_UARTnTimer(PORTn);
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	switch(UARTCtrl->BroadcastTime)//广播校时0=空,1=,2=,3=命令,4=过程...,完成后自动回到0
	{
		default:
			break;
		case 3://3=命令读
			if((UARTCtrl->Task==0)||(UARTCtrl->Task==2))//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
			{
				Terminal_Router->StopFlags|=(1<<4);//暂停路由
				Terminal_Router->RouterCtrl=2;//路由器控制0=空,1=重启,2=暂停,3=恢复;完成后自动回到0
				UARTCtrl->BroadcastTime++;//广播校时0=空,1=,2=,3=命令,4=过程...,完成后自动回到0
				WarningOccur(PORTn,(u8 *)"载波准备广播校时");//告警发生,入口告警代码和告警字符串
			}
			break;
		case 4://等待1分
			p16timer[0]=60000/10;
			Terminal_Router->ReRouterCtrl=0;//路由器控制重发计数
			UARTCtrl->BroadcastTime++;//广播校时0=空,1=,2=,3=命令,4=过程...,完成后自动回到0
			break;
		case 5://通信延时相关广播通信时长查询
			if(p16timer[0]==0)
			{
				p8tx+=128;
				p8tx[0]=2;//控制字,0=透明传输，1=645-1997，2=645-2007，3=相位识别
				p8tx[1]=22;//报文长度
				MC(0xfe,((u32)p8tx)+2,4);
				p8tx[6]=0x68;
				MC(0x99,((u32)p8tx)+7,6);
				p8tx[13]=0x68;
				p8tx[14]=0x08;
				p8tx[15]=0x06;
				MR(((u32)p8tx)+16,ADDR_MYMDHMS,6);
				for(i=0;i<6;i++)
				{
					p8tx[16+i]+=0x33;
				}
				x=0;
				for(i=0;i<16;i++)
				{
					x+=p8tx[6+i];
				}
				p8tx[22]=x;
				p8tx[23]=0x16;
				Uart_3762_TxData(PORTn,0x03,9,24);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
				UARTCtrl->BroadcastTime++;//广播校时0=空,1=,2=,3=命令,4=过程...,完成后自动回到0	
				WarningOccur(PORTn,(u8 *)"载波正在广播校时");//告警发生,入口告警代码和告警字符串
			}
			break;
		case 6://发广播校时
			if(UARTCtrl->Task>=3)//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
			{
				break;
			}
			i=MRR(((u32)p8rx)+10,3);
			if((i!=0x010103)||(UARTCtrl->Task!=1))
			{
				if(Terminal_Router->ReRouterCtrl<2)//路由器控制重发计数
				{
					Terminal_Router->ReRouterCtrl++;
					UARTCtrl->BroadcastTime--;//广播校时0=空,1=,2=,3=命令,4=过程...,完成后自动回到0
				}
				else
				{
					UARTCtrl->BroadcastTime=10;//广播校时0=空,1=,2=,3=命令,4=过程...,完成后自动回到0
				}
				break;
			}
			i=MRR(((u32)p8rx)+13,2);//广播通信延迟时间秒
			p8tx+=128;
			p8tx[0]=2;//控制字,0=透明传输，1=645-1997，2=645-2007，3=相位识别
			p8tx[1]=22;//报文长度
			MC(0xfe,((u32)p8tx)+2,4);
			p8tx[6]=0x68;
			MC(0x99,((u32)p8tx)+7,6);
			p8tx[13]=0x68;
			p8tx[14]=0x08;
			p8tx[15]=0x06;
			d64=MRR(ADDR_MYMDHMS,6);
			d64=YMDHMS_AddS(d64,i);//年月日时分秒加S秒,返回加S秒后的年月日时分秒
			MWR(d64,((u32)p8tx)+16,6);
			for(i=0;i<6;i++)
			{
				p8tx[16+i]+=0x33;
			}
			x=0;
			for(i=0;i<16;i++)
			{
				x+=p8tx[6+i];
			}
			p8tx[22]=x;
			p8tx[23]=0x16;
			Uart_3762_TxData(PORTn,0x05,3,24);//376.2发送数据填入发送区,入口时若有信息域目的地址数据单元等则已填入,数据单元暂固定填入发送缓冲区+128地址
			Terminal_Router->ReRouterCtrl=0;//路由器控制重发计数
			if(Terminal_Router->RouterRunMode_7==0)//路由运行模式_广播命令确认方式：0表示广播命令在本地通信模块执行广播通信过程完毕后返回确认报文，1表示广播命令在本地信道执行广播通信之前就返回确认报文，需要集中器等待的时间在确认报文的"等待执行时间"信息中体现
			{
				Terminal_Ram->RouterCheck_S_Timer=Terminal_Router->MaxBroadcastOverTime;//最大广播超时时间秒(半字对齐)
			}
			UARTCtrl->BroadcastTime++;//广播校时0=空,1=,2=,3=命令,4=过程...,完成后自动回到0	
			break;
		case 7://接收确认帧
			if(Terminal_Router->RouterRunMode_7==0)//路由运行模式_广播命令确认方式：0表示广播命令在本地通信模块执行广播通信过程完毕后返回确认报文，1表示广播命令在本地信道执行广播通信之前就返回确认报文，需要集中器等待的时间在确认报文的"等待执行时间"信息中体现
			{//0表示广播命令在本地通信模块执行广播通信过程完毕后返回确认报文
				switch(UARTCtrl->Task)//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
				{
					case 1://1=完成1帧发收
						if(Get_Uart_3762_RxData_AFN_Fn(PORTn)==0x0001)//UART_3762接收数据得到AFN,Fn;B15-B8=AFN,B7-B0=Fn
						{
							p16timer[0]=0;
							UARTCtrl->BroadcastTime++;//广播校时0=空,1=,2=,3=命令,4=过程...,完成后自动回到0
						}
						else
						{
							UARTCtrl->RxByte=0;//RX计数(已接收字节数)=0
							UARTCtrl->Task=5;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
							p16timer[0]=1000/10;//发送后接收超时定时值ms/10(半字对齐)
						}
						break;
					case 0://0=空闲
					case 2://2=接收超时(或错误)
						if(Terminal_Ram->RouterCheck_S_Timer==0)//最大广播超时时间秒(半字对齐)
						{
							p16timer[0]=0;
							UARTCtrl->BroadcastTime++;//广播校时0=空,1=,2=,3=命令,4=过程...,完成后自动回到0
						}
						else
						{
							UARTCtrl->RxByte=0;//RX计数(已接收字节数)=0
							UARTCtrl->Task=5;//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
							p16timer[0]=1000/10;//发送后接收超时定时值ms/10(半字对齐)
						}
						break;
				}
			}
			else
			{//1表示广播命令在本地信道执行广播通信之前就返回确认报文，需要集中器等待的时间在确认报文的"等待执行时间"信息中体现
				switch(UARTCtrl->Task)//UART_3762接收发送;0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收
				{
					case 1://1=完成1帧发收
						if(Get_Uart_3762_RxData_AFN_Fn(PORTn)==0x0001)//UART_3762接收数据得到AFN,Fn;B15-B8=AFN,B7-B0=Fn
						{
							//取等待时间
							i=p8rx[17];
							i+=p8rx[18]<<8;
							i*=1000/10;
							if(i>0xffff)
							{
								i=0xffff;
							}
							p16timer[0]=i;
							UARTCtrl->BroadcastTime++;//广播校时0=空,1=,2=,3=命令,4=过程...,完成后自动回到0
							break;
						}
						else
						{
							if(Terminal_Router->ReRouterCtrl<2)//路由器控制重发计数
							{
								Terminal_Router->ReRouterCtrl++;
								UARTCtrl->BroadcastTime--;//广播校时0=空,1=,2=,3=命令,4=过程...,完成后自动回到0
							}
							else
							{
								UARTCtrl->BroadcastTime=10;//广播校时0=空,1=,2=,3=命令,4=过程...,完成后自动回到0
							}
						}
						break;
					case 0://0=空闲
					case 2://2=接收超时(或错误)
						UARTCtrl->BroadcastTime=10;//广播校时0=空,1=,2=,3=命令,4=过程...,完成后自动回到0
						break;
				}
			}
			break;
		case 8://等待广播延时
			if(p16timer[0]==0)
			{
				UARTCtrl->BroadcastTime=10;//广播校时0=空,1=,2=,3=命令,4=过程...,完成后自动回到0
			}
			break;
//		case 9:
//			break;
		case 10:
			Terminal_Router->StopFlags&=~(1<<4);//恢复路由
			Terminal_Router->RouterCtrl=3;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态,5=真恢复;完成后自动回到0
			UARTCtrl->BroadcastTime=0;//广播校时0=空,1=,2=,3=命令,4=过程...,完成后自动回到0
		#if ((USER/100)==5)//上海
			i=MRR(ADDR_AFN05F201,1);
			if(i&(1<<3))
			{
				i&=~(1<<3);
				MWR(i,ADDR_AFN05F201,1);
			}
		#endif
			break;
	}
}
*/


#endif

